Rhino.Render.ChangeQueue.Mesh.Object
Get a copy of the original RhinoObject this Mesh is created from. Possible only after
return true from ChangeQueue.ProvideOriginalObject().
Access this only with a using(var o = mesh.Object) {} construct.
Note that the object is free floating, i.e. not part of a document.