Rhino.Render.RealtimeDisplayMode.PostConstruct
Override PostConstruct if you need to initialize where
the underlying RealtimeDisplayMode is available.
The connection is made right after RealtimeDisplayMode
has been instantiated, but just before PostConstruct is called.
For instance finding out OpenGL information can be done in
PostConstruct.

Rhino.Render.RealtimeDisplayMode.StartRenderer(System.Int32,System.Int32,Rhino.RhinoDoc,Rhino.DocObjects.ViewInfo,Rhino.DocObjects.ViewportInfo,System.Boolean,Rhino.Render.RenderWindow)
Override to start your render engine.
Note that before using the RenderWindow you *must* call SetSize
to properly initialize the underlying DIB.
w: Width of resolution
h: Height of resolution
doc: Rhino document
view: active view
viewportInfo: active viewport info
forCapture: true if renderer is started for capture purposes (ViewCaptureTo*), false for regular interactive rendering
renderWindow: RenderWindow to hold render results in.
Returns: Return true when your render engine started correctly, false when that failed