Rhino.Input.Custom.GetPoint.PointOnSurface(System.Double@,System.Double@)
Use to determine if point was on a surface. If the point was on a surface,
then the (u,v) are the surface parameters for the point. The point returned
by Point() is the same as surface.PointAt(u,v).
u: If the point was on a surface, then the u parameter.
v: If the point was on a surface, then the v parameter.
Returns: The surface or null if the point was not on a surface.

Rhino.Input.Custom.GetPoint.PointOnBrep(System.Double@,System.Double@)
Use to determine if point was on a Brep face. If the point was on a Brep face,
then the (u,v) are the face parameters for the point.
u: If the point was on a Brep face, then the u parameter.
v: If the point was on a Brep face, then the v parameter.
Returns: The Brep face or null if the point was not on a Brep face.