Rhino.NodeInCode.ComponentFunctionInfo.OutputNames
Grasshopper returns several items in general. This property returns the output names.

Rhino.NodeInCode.ComponentFunctionInfo.OutputDescriptions
Grasshopper returns several items in general. This property returns the output descriptions.

Rhino.NodeInCode.ComponentFunctionInfo.OutputTypeNames
Grasshopper returns several items in general. This property returns the output type names.

Rhino.NodeInCode.ComponentFunctionInfo.ComponentGuid
The unique identifier of the Grasshopper component.
It is the original developer's responsibility to ensure that this ID is unique.

Rhino.NodeInCode.ComponentFunctionInfo.Evaluate(System.Collections.IEnumerable,System.Boolean,System.String[]@)
Evaluates the component with a set of arguments.
There needs to be an argument for each input param, and each output param gives an entry in the output array.
args: The arguments list. Each item is assigned to each input param, in order.
keepTree: A value indicating whether trees should be considered valid inputs, and should be returned.
In this case, output variables are not simplified to common types.
warnings: A possible list of warnings, or null.
Returns: An array of objects, each representing an output result.
Remarks: For component that store no state, this method is thread safe.