Rhino.Geometry.Dimension.ForceText.HintRight
If override isn't specified and text doesn't fit, move it right

Rhino.Geometry.Dimension.ForceText.HintLeft
If override isn't specified and text doesn't fit, move it left