Rhino.Render.TextureMapping.TryGetMappingBox(Rhino.Geometry.Plane@,Rhino.Geometry.Interval@,Rhino.Geometry.Interval@,Rhino.Geometry.Interval@,System.Boolean@)
Get a box projection from the texture mapping, including capped information
plane:
The center of the box is at plane.origin and the sides of the box are
parallel to the plane's coordinate planes.
dx:
The "front" and "back" sides of the box are in spanned by the vectors
plane.yaxis and plane.zaxis.  The back plane contains the point
plane.PointAt(dx[0],0,0) and the front plane contains the point
plane.PointAt(dx[1],0,0).
dy:
The "left" and "right" sides of the box are in spanned by the vectors
plane.zaxis and plane.xaxis.  The left plane contains the point
plane.PointAt(0,dx[0],0) and the back plane contains the point
plane.PointAt(0,dy[1],0).
dz:
The "top" and "bottom" sides of the box are in spanned by the vectors
plane.xaxis and plane.yaxis.  The bottom plane contains the point
plane.PointAt(0,0,dz[0]) and the top plane contains the point
plane.PointAt(0,0,dz[1]).
capped: true if box mapping is capped.
Returns:
Returns true if a valid box is returned.
Remarks:
Generally, GetMappingBox will not return the same parameters passed to
SetBoxMapping.  However, the location of the box will be the same.

Rhino.Render.TextureMapping.TryGetMappingCylinder(Rhino.Geometry.Cylinder@,System.Boolean@)
Get a cylindrical projection parameters from this texture mapping.
cylinder:
capped: will be true if capped
Returns:
Returns true if a valid cylinder is returned.
Remarks:
Generally, GetMappingCylinder will not return the same parameters passed
to SetCylinderMapping.  However, the location of the cylinder will be
the same.  If this mapping is not cylindrical, the cylinder will
approximate the actual mapping primitive.

Rhino.Render.TextureMapping.TryGetMappingPlane(Rhino.Geometry.Plane@,Rhino.Geometry.Interval@,Rhino.Geometry.Interval@,Rhino.Geometry.Interval@,System.Boolean@)
Get plane mapping parameters from this texture mapping, including capping information
plane:
dx:
Portion of the plane's x axis that is mapped to [0,1]
dy:
Portion of the plane's y axis that is mapped to [0,1]
dz:
Portion of the plane's z axis that is mapped to [0,1]
capped:
Returns:
Return true if valid plane mapping parameters were returned.
Remarks:
NOTE WELL:
Generally, GetMappingPlane will not return the same parameters passed
to SetPlaneMapping.  However, the location of the plane will be the
same.

Rhino.Render.TextureMapping.CreatePlaneMapping(Rhino.Geometry.Plane,Rhino.Geometry.Interval,Rhino.Geometry.Interval,Rhino.Geometry.Interval)
Create a planar UV projection texture mapping
plane: A plane to use for mapping.
dx: portion of the plane's x axis that is mapped to [0,1] (can be a decreasing interval)
dy: portion of the plane's y axis that is mapped to [0,1] (can be a decreasing interval)
dz: portion of the plane's z axis that is mapped to [0,1] (can be a decreasing interval)
Returns: TextureMapping instance if input is valid

Rhino.Render.TextureMapping.CreatePlaneMapping(Rhino.Geometry.Plane,Rhino.Geometry.Interval,Rhino.Geometry.Interval,Rhino.Geometry.Interval,System.Boolean)
Create a planar projection texture mapping
plane: A plane to use for mapping.
dx: portion of the plane's x axis that is mapped to [0,1] (can be a decreasing interval)
dy: portion of the plane's y axis that is mapped to [0,1] (can be a decreasing interval)
dz: portion of the plane's z axis that is mapped to [0,1] (can be a decreasing interval)
capped: set to true if planar UVW is meant, false for planar UV
Returns: TextureMapping instance if input is valid

Rhino.Render.TextureMapping.CreateCustomMeshMapping(Rhino.Geometry.Mesh)
Create custom mesh mapping
mesh: Mesh with texture coordinates
Returns: TextureMapping instance