Rhino.Display.DisplayPipeline.PreDrawTransparentObjects
Called before transparent objects have been drawn. Depth writing and testing are on.

Rhino.Display.DisplayPipeline.GetLights
Get lights that this pipeline is current using
Returns:

Rhino.Display.DisplayPipeline.AddClippingPlane(Rhino.Geometry.Point3d,Rhino.Geometry.Vector3d)
Add a clipping plane to be used during the drawing of this frame
point: point on the plane
normal: vector perpendicular to the plane
Returns: index for the added clipping plane

Rhino.Display.DisplayPipeline.RemoveClippingPlane(System.Int32)
Remove a clipping plane from the pipeline for this frame
index:

Rhino.Display.DisplayPipeline.GetOpenGLWorldToCamera(System.Boolean)
Get an array of 16 floats that represents the "world" to "camera" coordinate
transformation in OpenGL's right handed coordinate system
includeModelTransform:
Returns:

Rhino.Display.DisplayPipeline.GetOpenGLWorldToClip(System.Boolean)
Get an array of 16 floats that represents the "world" to "clip" coordinate
transformation in OpenGL's right handed coordinate system
includeModelTransform:
Returns:

Rhino.Display.DisplayPipeline.GetOpenGLCameraToClip
Get an array of 16 floats that represents the "camera" to "clip" coordinate
transformation in OpenGL's right handed coordinate system
Returns:

Rhino.Display.DisplayPipeline.DrawStereoFrameBuffer(Rhino.DocObjects.ViewportInfo,Rhino.DocObjects.ViewportInfo,System.UInt32@,System.UInt32@)
Draws the viewport as seen from the left and the right eye viewports
and returns the result as OpenGL texture handles.
viewportLeft: The viewport representing the left eye location and look direction.
viewportRight: The viewport representing the right eye location and look direction.
handleLeft: Will contain the OpenGL texture handle which references the left output color buffer.
handleRight: Will contain the OpenGL texture handle which references the right output color buffer.
Returns: true if drawing succedded, false otherwise.