Rhino.UI.ObjectPropertiesPage.PageIcon(System.Drawing.Size)
Icon to display in the object properties tab control.  Will not get called
if PageIconEmbeddedResourceString is overriden and provides a string for a
successfully loaded icon resrouce.
sizeInPixels:
The requested icon size in pixels, DPI scaling has been applied.  The
default value is 24 X DPI scale.
Returns:

Rhino.UI.ObjectPropertiesPage.AllObjectsMustBeSupported
Returns true when running on Mac which requires only objects of
SupportedTypes.  Returns false when running on Windows which only
requires a single item of SupportedTypes to be selected.
Override if you wish to change the above behavior.

Rhino.UI.ObjectPropertiesPage.PageIconEmbeddedResourceString
Resource string for a embedded icon resource in the assembly containing
the page instance.  If this returns a valid resource and Rhino can
load the icon the loaed icon will get used directly otherwise;
the PageIcon method will get called.
The page icon embedded resource string.

Rhino.UI.ObjectPropertiesPage.AnySelectedObject``1(System.Boolean)
Return true if any of the selected objects match the given type
allMustMatch:
If true then every selected object must match the object type
otherwise; only a single object has to be of the specified type
Returns: