Rhino.Geometry.Dimension.GetTextTransform(Rhino.DocObjects.ViewportInfo,Rhino.DocObjects.DimensionStyle,System.Double,System.Boolean)
Get the transform for this text object's text geometry
viewport: Viewport where text is being used
style: Dimension's DimensionStyle
textScale: Scale to apply to text
drawForward: Draw text front-facing