Rhino.Commands.Command.RunProxyCommand(Rhino.Commands.Command.RunCommandDelegate,Rhino.RhinoDoc,System.Object)
Execute some code as if it were running in a command
doc:
commandCallback:
data: optional extra data to pass to callback