Rhino.FileIO.FilePdf.PreWrite
Fired immediately before a Pdf is written

Rhino.FileIO.FilePdf.AddPage(Rhino.Display.ViewCaptureSettings)
Add a new page to this document and draw a viewport into it based on
provided ViewCaptureSettings
settings:
Returns: page number on success

Rhino.FileIO.FilePdf.AddPage(System.Int32,System.Int32,System.Int32)
Add a blank page to this document
widthInDots:
heightInDots:
dotsPerInch:
Returns: page number on success

Rhino.FileIO.FilePdf.DrawText(System.Int32,System.String,System.Double,System.Double,System.Single,Rhino.DocObjects.Font,System.Drawing.Color,System.Drawing.Color,System.Single,System.Single,Rhino.DocObjects.TextHorizontalAlignment,Rhino.DocObjects.TextVerticalAlignment)
Draw text on a page
pageNumber:
text:
x:
y:
heightPoints:
onfont:
fillColor:
strokeColor:
strokeWidth:
angleDegrees:
horizontalAlignment:
verticalAlignment:

Rhino.FileIO.FilePdf.DrawPolyline(System.Int32,System.Drawing.PointF[],System.Drawing.Color,System.Drawing.Color,System.Single)
Draw a polyline path
pageNumber:
polyline:
fillColor:
strokeColor:
strokeWidth:

Rhino.FileIO.FilePdf.DrawLine(System.Int32,System.Drawing.PointF,System.Drawing.PointF,System.Drawing.Color,System.Single)
Draw a line
pageNumber:
from:
to:
strokeColor:
strokeWidth:

Rhino.FileIO.FilePdf.DrawBitmap(System.Int32,System.Drawing.Bitmap,System.Single,System.Single,System.Single,System.Single,System.Single)
Draw a bitmap
pageNumber:
bitmap:
left:
top:
width:
height:
rotationInDegrees: