Rhino.Runtime.InteropWrappers.SimpleArrayClippingPlaneObjectPointer.ConstPointer
Gets the const (immutable) pointer of this array.
Returns: The const pointer.

Rhino.Runtime.InteropWrappers.SimpleArrayClippingPlaneObjectPointer.NonConstPointer
Gets the non-const pointer (for modification) of this array.
Returns: The non-const pointer.

Rhino.Runtime.InteropWrappers.SimpleArrayClippingPlaneObjectPointer.#ctor
Initializes a new Rhino.Runtime.InteropWrappers.SimpleArrayClippingPlaneObjectPointer instance.

Rhino.Runtime.InteropWrappers.SimpleArrayClippingPlaneObjectPointer.Count
Gets the amount of clipping planes in this array.

Rhino.Runtime.InteropWrappers.SimpleArrayClippingPlaneObjectPointer.Add(Rhino.DocObjects.ClippingPlaneObject,System.Boolean)
Adds a clipping plane to the list.
clippingplane: A clipping plane to add.
asConst: Whether this clipping plane should be treated as non-modifiable.

Rhino.Runtime.InteropWrappers.SimpleArrayClippingPlaneObjectPointer.Dispose
Actively reclaims unmanaged resources that this instance uses.