Rhino.Geometry.TextEntity.Create(System.String,Rhino.Geometry.Plane,Rhino.DocObjects.DimensionStyle,System.Boolean,System.Double,System.Double)
Create Text geometry or null if input is invalid
text:
plane:
style:
wrapped:
rectWidth:
rotationRadians:
Returns:

Rhino.Geometry.TextEntity.CreateWithRichText(System.String,Rhino.Geometry.Plane,Rhino.DocObjects.DimensionStyle,System.Boolean,System.Double,System.Double)
Create RichText geometry or null if input is invalid
richTextString:
plane:
style:
wrapped:
rectWidth:
rotationRadians:
Returns:

Rhino.Geometry.TextEntity.Transform(Rhino.Geometry.Transform,Rhino.DocObjects.DimensionStyle)
Transform the object by a 4x4 transform matrix and change text height
override to accommodate scaling in the transform if necessary
transform:
An Transform with the transformation information
style:
Returns:
Returns true on success otherwise returns false.