Rhino.Geometry.Point2f.op_Subtraction(Rhino.Geometry.Point2f,Rhino.Geometry.Point2f)
Subtracts two Rhino.Geometry.Point2fs.
a: First point.
b: Second point.
Returns: A subtracted Vector2f.

Rhino.Geometry.Point2f.op_Multiply(Rhino.Geometry.Point2f,System.Single)
Multiplies a Rhino.Geometry.Point2f by a scalar.
a: First point.
b: Scalar.
Returns: A multiplied Point2f.

Rhino.Geometry.Point2f.op_Division(Rhino.Geometry.Point2f,System.Single)
Divides a Rhino.Geometry.Point2f by a scalar.
a: First point.
b: Scalar.
Returns: A divided Point2f.