Rhino.Geometry.Collections.MeshTopologyEdgeList.IsEdgeUnwelded(System.Int32)
Determines if the mesh edge is unwelded, or if the mesh faces that share the edge have unique vertex indices.
topologyEdgeIndex: An index of a topology edge in Rhino.Geometry.Mesh.TopologyEdges.
Returns: true if the edge is unwelded, false if the edge is welded.