Rhino.Runtime.InteropWrappers.SimpleArrayLinetypePointer.ConstPointer
Gets the const (immutable) pointer of this array.
Returns: The const pointer.

Rhino.Runtime.InteropWrappers.SimpleArrayLinetypePointer.NonConstPointer
Gets the non-const pointer (for modification) of this array.
Returns: The non-const pointer.

Rhino.Runtime.InteropWrappers.SimpleArrayLinetypePointer.#ctor
Initializes a new Rhino.Runtime.InteropWrappers.SimpleArrayLinetypePointer instance.

Rhino.Runtime.InteropWrappers.SimpleArrayLinetypePointer.Count
Gets the amount of linetypes in this array.

Rhino.Runtime.InteropWrappers.SimpleArrayLinetypePointer.Dispose
Actively reclaims unmanaged resources that this instance uses.

Rhino.Runtime.InteropWrappers.SimpleArrayLinetypePointer.ToNonConstArray
Copies the unmanaged array to a managed counterpart.
Returns: The managed array.