Rhino.Runtime.Notifications.Notification.AllowedAssemblies
The assemblies that can modify this instance.
Remarks: If empty, any assembly is allowed to edit the instance. You
may specify additional assemblies that should have access to an instance at creation time.

Rhino.Runtime.Notifications.Notification.Title
The title of the notification. The title is displayed when the notification is displayed modally in Rhino.
Throws System.InvalidOperationException: Thrown if the calling assembly cannot modify this instance

Rhino.Runtime.Notifications.Notification.Description
The description of the notification. The description is displayed in the Notifications panel in Rhino.
Throws System.InvalidOperationException: Thrown if the calling assembly cannot modify this instance

Rhino.Runtime.Notifications.Notification.Message
The message of the notification. The message is shown only when the instance is displayed modally. It should contain details about the notification.
Throws System.InvalidOperationException: Thrown if the calling assembly cannot modify this instance

Rhino.Runtime.Notifications.Notification.SeverityLevel
The severity of the notification. Changing the severity of the notification may change the way Rhino chooses to display the Notifications panel.
Throws System.InvalidOperationException: Thrown if the calling assembly cannot modify this instance

Rhino.Runtime.Notifications.Notification.CancelButtonTitle
The localized title of the Cancel button.
Throws System.InvalidOperationException: Thrown if the calling assembly cannot modify this instance
Remarks: Notifications can 1 to 3 buttons for user input. Each button can have a localized title. With the exception of the Cancel button,
setting a button title to null (the default) will prevent that button from appearing in the interface. Note that in order for buttons
other than the Cancel button to be displayed, you must set a Rhino.Runtime.Notifications.Notification.ButtonClicked Action.

Rhino.Runtime.Notifications.Notification.ConfirmButtonTitle
The localized title of the Confirm button.
Throws System.InvalidOperationException: Thrown if the calling assembly cannot modify this instance
Remarks: Notifications can 1 to 3 buttons for user input. Each button can have a localized title. With the exception of the Cancel button,
setting a button title to null (the default) will prevent that button from appearing in the interface. Note that in order for buttons
other than the Cancel button to be displayed, you must set a Rhino.Runtime.Notifications.Notification.ButtonClicked Action.

Rhino.Runtime.Notifications.Notification.AlternateButtonTitle
The localized title of the Alternate button.
Throws System.InvalidOperationException: Thrown if the calling assembly cannot modify this instance
Remarks: Notifications can 1 to 3 buttons for user input. Each button can have a localized title. With the exception of the Cancel button,
setting a button title to null (the default) will prevent that button from appearing in the interface. Note that in order for buttons
other than the Cancel button to be displayed, you must set a Rhino.Runtime.Notifications.Notification.ButtonClicked Action.

Rhino.Runtime.Notifications.Notification.ShowEventId
A field used by Rhino for displaying notifications. Not intended for public use.

Rhino.Runtime.Notifications.Notification.ExecuteAssemblyProtectedCode(System.Action)
If a Rhino.Runtime.Notifications.Notification object is only allowed to be modified by certain
assemblies, then any code that interacts with it must be wrapped around this method,
or a System.InvalidOperationException will be thrown. For performance reasons,
the code wrapped by this method should be kept as simple as possible.
action: The code to run that modifies one or more notification objects
Remarks: This method is not thread-safe and should only be manipulated in UI thread.

Rhino.Runtime.Notifications.Notification.ExecuteAssemblyProtectedCode``1(System.Func{``0})
If a Rhino.Runtime.Notifications.Notification object is only allowed to be modified by certain
assemblies, then any code that interacts with it must be wrapped around this method,
or a System.InvalidOperationException will be thrown. For performance reasons,
the code wrapped by this method should be kept as simple as possible.
func: The code to run that modifies one or more notification objects
Remarks: This method is not thread-safe and should only be manipulated in UI thread.

Rhino.Runtime.Notifications.Notification.#ctor(System.Collections.Generic.IEnumerable{System.Reflection.Assembly})
Creates a new instance that can be edited by the given assemblies.
allowedAssemblies: The assemblies that will be allowed to edit the instance.
If null or empty, any assembly will be able to edit this notification.
Remarks: Specifying one or more assemblies limits certain operations with the notification object,
throwing an System.InvalidOperationException if an assembly outside the ones passed tries to interact with it.
Any code that tries to interact with a notification object that has restricted assemblies must be wrapped in a
Rhino.Runtime.Notifications.Notification.ExecuteAssemblyProtectedCode(System.Action). For performance reasons,
it is imporant that such methods are kept as simple as possible.

Rhino.Runtime.Notifications.Notification.#ctor
Creates a new instance that can be edited by any assembly.

Rhino.Runtime.Notifications.Notification.HideModal
Tells Rhino to hide the notification if it is being currently shown as a modal.
Throws System.InvalidOperationException: Thrown if the calling assembly cannot modify this instance
Remarks: If the notification is not being currently shown but is being queued by Rhino as
a result of calling Rhino.Runtime.Notifications.Notification.ShowModal, then the notification will be dequeued.
If the notification was never queued, then this method has no effect.

Rhino.Runtime.Notifications.Notification.RemoveMetadata(System.String)
Removes metadata from this instance.
key: The key of the metadata to remove.
Returns: true if the metada was removed; otherwise false.
Throws System.InvalidOperationException: Thrown if the calling assembly cannot modify this instance

Rhino.Runtime.Notifications.Notification.Editable
Determines whether an assembly can modify the instance. Any code that modifies an assembly protected
notification must be wrapped in a Rhino.Runtime.Notifications.Notification.ExecuteAssemblyProtectedCode(System.Action) method.
Remarks: Before modifying a notification you are not sure you created (such as a notification returned
from a LINQ query), you should call this method first to ensure you can indeed edit the object.