Rhino.FileIO.FileWriteOptions.UpdateDocumentPath
If a complete, current version, 3dm file is successfully saved, then
the name of the file will be used to update the document's default file
path and title and document will be marked as not modified.

Rhino.FileIO.FileWriteOptions.DestinationFileName
For use on Apple frameworks only.
Retrns the final destination file name.