Rhino.Geometry.Collections.NurbsCurvePointList.PointSize
Returns the control point size, or the number of doubles per control point.
For rational curves, PointSize = Curve.Dimension + 1.
For non-rational curves, PointSize = Curve.Dimension.