Rhino.DocObjects.Tables.SnapshotTable.Document
Document that owns this table.

Rhino.DocObjects.Tables.SnapshotTable.Names
Array of Snapshot names.
Returns:
A string array with the names of all Snapshots in the document.