Rhino.Geometry.Collections.NurbsCurveKnotList.RemoveMultipleKnots(System.Int32,System.Int32,System.Double)
Remove multiple knots from this curve.
minimumMultiplicity:
Remove knots with multiplicity > minimumKnotMultiplicity.
maximumMultiplicity:
Remove knots with multiplicity < maximumKnotMultiplicity.
tolerance:
When you remove knots, the shape of the curve is changed.
If tolerance is RhinoMath.UnsetValue, any amount of change is permitted.
If tolerance is >=0, the maximum distance between the input and output
curve is restricted to be <= tolerance.
Returns: number of knots removed on success. 0 if no knots were removed