Rhino.Geometry.Transform.ZeroTransformation
ZeroTransformation diagonal = (0,0,0,1)

Rhino.Geometry.Transform.RotationZYX(System.Double,System.Double,System.Double)
Create rotation transformation From Tait-Byran angles (also loosely known as Euler angles).
yaw: Angle, in radians, to rotate about the Z axis.
pitch: Angle, in radians, to rotate about the Y axis.
roll: Angle, in radians, to rotate about the X axis.
Returns: A transform matrix from Tait-Byran angles.
Remarks:
RotationZYX(yaw, pitch, roll) = R_z(yaw) * R_y(pitch) * R_x(roll)
where R_*(angle) is rotation of angle radians about the corresponding world coordinate axis.

Rhino.Geometry.Transform.RotationZYZ(System.Double,System.Double,System.Double)
Create rotation transformation From Euler angles.
alpha: Angle, in radians, to rotate about the Z axis.
beta: Angle, in radians, to rotate about the Y axis.
gamma: Angle, in radians, to rotate about the X axis.
Returns: A transform matrix from Euler angles.
Remarks:
RotationZYZ(alpha, beta, gamma) = R_z(alpha) * R_y(beta) * R_z(gamma)
where R_*(angle) is rotation of angle radians about the corresponding *-world coordinate axis.
Note, alpha and gamma are in the range (-pi, pi] while beta in in the range [0, pi]

Rhino.Geometry.Transform.Diagonal(Rhino.Geometry.Vector3d)
Constructs a new transformation with diagonal (d0,d1,d2,1.0).
diagonal: The diagonal values.
Returns: A transformation with diagonal (d0,d1,d2,1.0).

Rhino.Geometry.Transform.Diagonal(System.Double,System.Double,System.Double)
Constructs a new transformation with diagonal (d0,d1,d2,1.0).
d0: Transform.M00 value.
d1: Transform.M11 value.
d2: Transform.M22 value.
Returns: A transformation with diagonal (d0,d1,d2,1.0).

Rhino.Geometry.Transform.PlaneToPlane(Rhino.Geometry.Plane,Rhino.Geometry.Plane)
Create a rotation transformation that orients plane0 to plane1. If you want to orient objects from
one plane to another, use this form of transformation.
plane0: The plane to orient from.
plane1: the plane to orient to.
Returns: The translation transformation if successful, Transform.Unset on failure.

Rhino.Geometry.Transform.IsZero
True if matrix is Zero4x4, ZeroTransformation, or some other type of
zero.The value xform[3][3] can be anything.

Rhino.Geometry.Transform.IsZero4x4
True if all values are 0

Rhino.Geometry.Transform.IsZeroTransformation
True if all values are 0 and M33 is 1

Rhino.Geometry.Transform.IsZeroTransformaton(System.Double)
True if all values are 0 and M33 is 1 within tolerance.
zeroTolerance: The zero tolerance.
Returns: Returns true if all values are 0 and M33 is 1 within tolerance.

Rhino.Geometry.Transform.IsSimilarity(System.Double)
Gets a value indicating whether or not the Transform maintains similarity.
A similarity transformation can be broken into a sequence of a dialation, translation, rotation, and a reflection.
tolerance: The evaluation tolerance.
Returns: The similarity type.

Rhino.Geometry.Transform.DecomposeSimilarity(Rhino.Geometry.Vector3d@,System.Double@,Rhino.Geometry.Transform@,System.Double)
Decomposes a similarity transformation. The transformation must be affine.
A similarity transformation can be broken into a sequence of a dialation, translation, rotation, and a reflection.
translation: Translation vector.
dilation: Dialation, where dilation lt; 0 if this is an orientation reversing similarity.
rotation: A proper rotation transformation, where R*Transpose(R)=I and Determinant(R)=1.
tolerance: The evaluation tolerance.
Returns: The similarity type.
Remarks:
If X.DecomposeSimilarity(T, d, R, tol) !=0 then X ~ Translation(T)*Diagonal(d)*R
note when d gt;0 the transformation is orientation preserving.
If dilation lt; 0 then Diagonal(dilation) is actually a reflection combined with a true dialation, or
Diagonal(dilation) = Diagonal(-1) * Diagonal(|diagonal|).

Rhino.Geometry.Transform.RigidType
Gets a value indicating whether or not the Transform is rigid.
A rigid transformation can be broken into  a proper rotation and a translation,
while an isometry transformation could also include a reflection.

Rhino.Geometry.Transform.IsRigid(System.Double)
Gets a value indicating whether or not the Transform is rigid.
A rigid transformation can be broken into  a proper rotation and a translation,
while an isometry transformation could also include a reflection.
tolerance: The evaluation tolerance.
Returns: The rigid type.

Rhino.Geometry.Transform.DecomposeRigid(Rhino.Geometry.Vector3d@,Rhino.Geometry.Transform@,System.Double)
Decomposes a rigid transformation. The transfomration must be affine.
A rigid transformation can be broken into  a proper rotation and a translation,
while an isometry transformation could also include a reflection.
translation: Translation vector.
rotation: Proper rotation transformation, where R*Transpose(R)=I and det(R)=1.
tolerance: The evaluation tolerance.
Returns: The rigid type.
Remarks:
If X.DecomposeRigid(T, R) is 1, then X ~ Translation(T)*R.
If X.DecomposeRigid(T, R) is -1, then X ~ Transform(-1) * Translation(T)*R.
DecomposeRigid will find the closest rotation to the linear part of this transformation.

Rhino.Geometry.Transform.IsAffine
Tests for an affine transformation.
An affine transformation can be broken into a linear transformation and a translation.

Rhino.Geometry.Transform.IsLinear
Tests for a linear transformation.
An affine transformation can be broken into a linear transformation and a translation.

Rhino.Geometry.Transform.DecomposeAffine(Rhino.Geometry.Vector3d@,Rhino.Geometry.Transform@)
Decomposes an affine transformation.
An affine transformation can be broken into a linear transformation and a translation.
Note, a perspective transformation is not affine.
translation: Translation vector.
linear: Linear transformation.
Returns: True if successful decomposition.
Remarks:
If X.DecomposeAffine(T, L) is true then X == Translation(T)*L.
DecomposeAffine(T,L) succeeds for all affine transformations and is a simple copying of values.

Rhino.Geometry.Transform.DecomposeAffine(Rhino.Geometry.Transform@,Rhino.Geometry.Vector3d@)
Decomposes an affine transformation.
An affine transformation can be broken into a linear transformation and a translation.
Note, a perspective transformation is not affine.
linear: Linear transformation.
translation: Translation vector.
Returns: True if successful decomposition.
Remarks:
If X.DecomposeAffine(L, T) is true then X == L* Translation(T).
DecomposeAffine(L, T) may fail for affine transformations if L is not invertible,
and is more computationally expensive then X.DecomposeAffine(T, L).

Rhino.Geometry.Transform.DecomposeAffine(Rhino.Geometry.Vector3d@,Rhino.Geometry.Transform@,Rhino.Geometry.Transform@,Rhino.Geometry.Vector3d@)
An affine transformation can be decomposed into a Symmetric, Rotation and Translation.
Then the Symmetric component may be further decomposed as non-uniform scale in an orthonormal
coordinate system.
translation: Translation vector.
rotation: Proper rotation transformation.
orthogonal: Orthogonal basis.
diagonal: Diagonal elements of a Diagonal transformation.
Returns: True if successful decomposition.

Rhino.Geometry.Transform.IsRotation
Returns true if this is a proper rotation.

Rhino.Geometry.Transform.Affineize
Replaces the last row with (0 0 0 1), discarding any perspecive part of this transform

Rhino.Geometry.Transform.Linearize
Affineize() and replaces the last column with (0 0 0 1)^T, discarding any translation part of this transform.

Rhino.Geometry.Transform.Orthogonalize(System.Double)
Force the linear part of this transformation to be a rotation (or a rotation with reflection).
Use DecomposeRigid(T,R) to find the nearest rotation.
tolerance: The evaluation tolerance
Returns: true if successful, false otherwise.

Rhino.Geometry.Transform.DecomposeSymmetric(Rhino.Geometry.Transform@,Rhino.Geometry.Vector3d@)
A Symmetric linear transformation can be decomposed A = Q * Diag * Q ^ T, where Diag is a diagonal
transformation. Diag[i][i] is an eigenvalue of A and the i-th coulmn of Q is a corresponding
unit length eigenvector. Note, this transformation must be Linear and Symmetric.
matrix: An orthonormal matrix of eigenvectors (Q).
diagonal: A vector of eigenvalues.
Returns: true if successful, false otherwise.
Remarks:
If success, this== Q*Diagonal(diagonal) * QT, where QT == Q.Transpose().
If L.IsLinear and LT==L.Transpose then LT*L is symmetric and is a common source of symmetric transformations.

Rhino.Geometry.Transform.GetYawPitchRoll(System.Double@,System.Double@,System.Double@)
Find the Tait-Byran angles (also loosely called Euler angles) for a rotation transformation.
yaw: Angle of rotation, in radians, about the Z axis.
pitch: Angle of rotation, in radians, about the Y axis.
roll: Angle of rotation, in radians, about the Z axis.
Returns: If true, then RotationZYX(yaw, pitch, roll) = R_z(yaw) * R_y(pitch) * R_x(roll)
where R_*(angle) is rotation of angle radians about the corresponding world coordinate axis.
If false, then this is not a rotation.

Rhino.Geometry.Transform.GetEulerZYZ(System.Double@,System.Double@,System.Double@)
Find the Euler angles for a rotation transformation.
alpha: Angle of rotation, in radians, about the Z axis.
beta: Angle of rotation, in radians, about the Y axis.
gamma: Angle of rotation, in radians, about the Z axis.
Returns:
If true, then RotationZYZ(alpha, beta, gamma) = R_z(alpha) * R_y(beta) * R_z(gamma)
where R_*(angle) is rotation of angle radians about the corresponding *-world coordinate axis.
If false, then this is not a rotation.
Remarks:
Note, alpha and gamma are in the range (-pi, pi] while beta in in the range [0, pi]