Rhino.UI.Dialogs.ShowContextMenu(System.Collections.Generic.IEnumerable{System.String},System.Drawing.Point,System.Collections.Generic.IEnumerable{System.Int32})
Creates an ETO ContextMenu from an array of strings. Use the modes array to enable/disable menu items
items:
screenPoint:
modes:
Returns:

Rhino.UI.Dialogs.ShowLineTypes(System.String,System.String,Rhino.RhinoDoc)
Displayes Rhino's Linetype list and returns the ID of the selected line type as a string.
title:
message:
doc:
Returns: