Rhino.RhinoDoc.WriteFile(System.String,Rhino.FileIO.FileWriteOptions)
Write information in this document to a file.
Note, the active document's name will be changed to that
of the path provided.
path: The name of the file to write.
options: The file writing options.
Returns: true if successful, false on failure.
Remarks:
This is the best choice for general file writing.
It handles making backups using temporary files,
locking and unlocking, loading file writing plug-ins,
and many other details.

Rhino.RhinoDoc.Write3dmFile(System.String,Rhino.FileIO.FileWriteOptions)
Write information in this document to a .3dm file.
Note, the active document's name will not be changed.
path: The name of the .3dm file to write.
options: The file writing options.
Returns: true if successful, false on failure.

Rhino.RhinoDoc.Create(System.String)
Creates a new RhinoDoc
modelTemplateFileName:
Name of a Rhino model to use as a template to initialize the document.
If the template contains views, those views are created.
If null, an empty document with no views is created
Returns:

Rhino.RhinoDoc.ModelBasepoint
The base point in the model that is used when inserting the model into another as a block definition.
By default the base point in any model is 0,0,0.

Rhino.RhinoDoc.ModelSpaceHatchScale
The scale factor for hatches in model space when Hatch Scaling is enabled

Rhino.RhinoDoc.ModelSpaceTextScale
The scale factor for text in model space when Annotation Scaling is enabled

Rhino.RhinoDoc.ModelSpaceAnnotationScalingEnabled
If ModelSpaceAnnotationScaling is on, sizes in dimstyles are multiplied by
dimscale when the annotation is displayed in a model space viewport not in a detail

Rhino.RhinoDoc.LayoutSpaceAnnotationScalingEnabled
If LayoutSpaceAnnotationScaling is on, sizes in dimstyles are multiplied by
dimscale when the annotation is displayed in a detail viewport not in a detail

Rhino.RhinoDoc.NamedConstructionPlanes
Collection of named construction planes.

Rhino.RhinoDoc.NamedViews
Collection of named views.

Rhino.RhinoDoc.RuntimeData
Collection of document runtime data. This is a good place to
put non-serializable, per document data, such as panel view models.
Note well: This data will be dispose with the document and does not
get serailzed.
The runtime document data table.

Rhino.RhinoDoc.NamedPositions
Collection of named positions.

Rhino.RhinoDoc.Snapshots
Collection of snapshots.

Rhino.RhinoDoc.NamedLayerStates
Collection of named layer states.

Rhino.RhinoDoc.EndUndoRecord(System.UInt32)
Ends the undo record.
undoRecordSerialNumber: The serial number of the undo record.
Returns: True if successful, false otherwise.

Rhino.RhinoDoc.UndoActive
Returns true if Undo is currently active.

Rhino.RhinoDoc.RedoActive
Returns true if Redo is currently active.

Rhino.RhinoDoc.SupportsRenderPrimitiveList(Rhino.DocObjects.ViewportInfo,Rhino.Display.DisplayPipelineAttributes)
Determines if custom render meshes will be built for this document (ie - GH meshes).
viewport: The viewport being rendered.
attrs:
Type of mesh to build. If attrs is non-null then a smaller mesh may be
generated in less time, false is meant when actually rendering.
Returns:
Returns true if custom render mesh(es) will get built for this document.

Rhino.RhinoDoc.GetRenderPrimitiveList(Rhino.DocObjects.ViewportInfo,Rhino.Display.DisplayPipelineAttributes)
Build custom render mesh(es) for this document (ie - GH meshes).
viewport: The viewport being rendered.
attrs:
Attributes for the view mode you are supplying meshes for.  Will be null if this is a modal rendering.
Returns:
Returns a RenderPrimitiveList if successful otherwise returns null.

Rhino.RhinoDoc.TryGetRenderPrimitiveBoundingBox(Rhino.DocObjects.ViewportInfo,Rhino.Display.DisplayPipelineAttributes,Rhino.Geometry.BoundingBox@)
Get the bounding box for the custom render meshes associated with this
document (ie - GH meshes).
viewport: The viewport being rendered.
attrs:
Attributes for the view mode you are supplying meshes for.  Will be null if this is a modal rendering.
boundingBox:
This will be set to BoundingBox.Unset on failure otherwise it will be
the bounding box for the custom render meshes associated with this
object.
Returns:
Returns true if the bounding box was successfully calculated otherwise
returns false on error.

Rhino.RhinoDoc.BeginOpenDocument
This event is raised when the document open operation begins.
NOTE: On Windows, this event will be fired when a clipboard paste
operation occurs, as Rhino opens a .tmp file in the User's
Local folder with the contents of the pasted document.