Rhino.PersistentSettingsConverter.ToString(System.Double)
Converts a double value to a string.
value: double value
Returns:
Returns the double value as a settings file formatted string.

Rhino.PersistentSettingsConverter.TryParseDouble(System.String,System.Double@)
Converts the string representation of a number to its double-precision
floating-point number equivalent. A return value indicates whether the
conversion succeeded or failed.
system culture.
s: A string containing a number to convert.
value:
When this method returns, contains the double-precision floating-point
number equivalent of the s parameter, if the conversion succeeded, or
zero if the conversion failed. The conversion fails if the s parameter
is null or Empty, is not a number in a valid format, or represents a
number less than MinValue or greater than MaxValue. This parameter is
passed uninitialized; any value originally supplied in result will be
overwritten.
Returns:
Returns true if s was converted successfully; otherwise, false..