Rhino.DocObjects.Linetype.SetSegments(System.Collections.Generic.IEnumerable{System.Double})
Set all segments.
segments:
An array of segments lengths.
Lengths >= 0 are interpreted as a line.
Lengths < 0 are interpreted as a space.
Returns: true if the segments were replaced

Rhino.DocObjects.Linetype.ReadFromFile(System.String)
Reads linetypes from either a Rhino .3dm file or an AutoCAD .lin file.
path: The path to the file to read.
Returns: An array of linetypes if successful, otherwise an empty array.