Rhino.DocObjects.HatchPattern.ReadFromFile(System.String,System.Boolean)
Reads hatch pattern definitions from a file.
filename:
Name of an existing file. If filename is null or empty, default hatch pattern filename is used.
quiet:
Ignored.
Returns: An array of hatch patterns. This can be null, but not empty.

Rhino.DocObjects.HatchPattern.CreatePreviewGeometry(System.Int32,System.Int32,System.Double)
Creates preview line segments of the hatch pattern.
width: The width of the preview.
height: The height of the preview.
angle: The rotation angle of the pattern display in radians.
Returns: The preview line segments if successful, an empty array on failure.