Rhino.Render.RenderSourceView.#ctor(Rhino.RhinoDoc)
Create a new RenderSourceView for the given doc.
Note that this should be done with using(var rsv = new RenderSourceView(doc)) {}
If the RenderSettings have the source view set to for instance a SnapShot this
construct will ensure that the (active) view is set to the correct snapshot, and
reverted back to the original once this instance goes out of scope.
doc: Rhino document

Rhino.Render.RenderSourceView.GetViewInfo
Get the ViewInfo as specified by the render source view settings.
Returns: ViewInfo if view was found, null otherwise