Rhino.Display.DisplayPipelineAttributes.FillMode
Get or set the frame buffer fill mode.

Rhino.Display.DisplayPipelineAttributes.ShowClippingPlanes
Show clipping planes.

Rhino.Display.DisplayPipelineAttributes.UseSingleCurveColor
Use a single color for drawing curves

Rhino.Display.DisplayPipelineAttributes.ShadingEnabled
Draw shaded meshes and surfaces. Set to false to use Flat Shading.

Rhino.Display.DisplayPipelineAttributes.ShadeVertexColors
Shade using vertex colors.

Rhino.Display.DisplayPipelineAttributes.ShowIsoCurves
Draw surface ISO curves.

Rhino.Display.DisplayPipelineAttributes.ShowSurfaceEdges
Show surface edges.

Rhino.Display.DisplayPipelineAttributes.ShowTangentEdges
Show tangent edges.

Rhino.Display.DisplayPipelineAttributes.ShowTangentSeams
Show tangent seams.

Rhino.Display.DisplayPipelineAttributes.SurfaceEdgeThickness
Thickness for surface edges

Rhino.Display.DisplayPipelineAttributes.ShowText
Show text.

Rhino.Display.DisplayPipelineAttributes.ShowAnnotations
Show annotations.

Rhino.Display.DisplayPipelineAttributes.ShowLights
Show light widgets.

Rhino.Display.DisplayPipelineAttributes.CastShadows
Cast shadows.

Rhino.Display.DisplayPipelineAttributes.ShowPoints
Show points.

Rhino.Display.DisplayPipelineAttributes.ShowPointClouds
Show point clouds.

Rhino.Display.DisplayPipelineAttributes.RealtimeRenderPasses
Get or set the realtime passes amount

Rhino.Display.DisplayPipelineAttributes.ShowRealtimeRenderProgressBar
Get or set whether the display is used for preview rendering or not.