Rhino.Render.Sun.SetPosition(System.Double,System.Double)
Sets position of the Sun based on azimuth and altitude values.
Using this function will also set sun to manual.
azimuthDegrees: The azimuth sun angle in degrees.
altitudeDegrees: The altitude sun angle in degrees.

Rhino.Render.Sun.Azimuth
Get the azimuth for the sun. To set use SetPosition(azimuth, altitude)

Rhino.Render.Sun.Altitude
Get the altitude for the sun. To set use SetPosition(azimuth, altitude)