Rhino.Geometry.SubD.NurbsSurfaceType
ON_SubD::NurbsSurfaceType specifies what type of NURBS surfaces are returned by ON_SubD.GetLimitSurfaceNurbs()

Rhino.Geometry.SubD.NurbsSurfaceType.Large
A single NURBS surface will be created for each SubD quad. Near extraordinary vertices, the surfaces may
have lots of knots.

Rhino.Geometry.SubD.NurbsSurfaceType.Medium
NURBS surfaces will be as large as possible without the addition of extra knots.
Near extraordinary vertices, the surfaces may
have lots of knots.
This option is prefered when a user wants larger NURBS surfaces but not at the cost of addtional NURBS control points.