Rhino.Geometry.SubD.SubDEdgeTag.X
This tag appears only on edges that have exactly two neighboring faces
and neither end vertex is tagged as ON_SubD::VertexTag::Smooth.
The level 1 subdivision point for a level 0 edge tagged as ON_SubD::EdgeTag::X
is the standard smooth edge subdivision point.
When subdivided, the new subdivision vertex will be tagged
as ON_SubD::VertexTag::Smooth and the subdivided edges will
be tagged as ON_SubD::EdgeTag::Smooth.  Thus, the tag ON_SubD::EdgeTag::X
should only appear at level 0.
This tag exists because the ON_SubD subdivision
algorithm requires any edge with both end vertices
tagged as not smooth must be subdivided at its midpoint.
Sector iterators treat "X" edges as smooth.
Both edge end weights must be set so the smooth
subdivided edges will be valid.