Rhino.DocObjects.Tables.ObjectTable.DeleteGrip(System.Guid)
Deletes a grip object.
gripId: The id of the grip object to delete.
Returns: True on success.

Rhino.DocObjects.Tables.ObjectTable.DeleteGrip(Rhino.DocObjects.ObjRef)
Deletes a grip object.
gripRef: A reference to the grip object to delete.
Returns: True on success.

Rhino.DocObjects.Tables.ObjectTable.DeleteGrip(Rhino.DocObjects.GripObject)
Deletes a grip object.
grip: The grip object to delete.
Returns: True on success.

Rhino.DocObjects.Tables.ObjectTable.DeleteGrips(System.Collections.Generic.IEnumerable{System.Guid})
Deletes one or more grip objects.
gripIds: The ids of the grip objects to delete.
Returns: The number of successfully deleted grip objects.

Rhino.DocObjects.Tables.ObjectTable.DeleteGrips(System.Collections.Generic.IEnumerable{Rhino.DocObjects.ObjRef})
Deletes one or more grip objects.
gripRefs: References to the grip objects to delete.
Returns: The number of successfully deleted grip objects.

Rhino.DocObjects.Tables.ObjectTable.DeleteGrips(System.Collections.Generic.IEnumerable{Rhino.DocObjects.GripObject})
Deletes one or more grip objects.
grips: The grip objects to delete.
Returns: The number of successfully deleted grip objects.

Rhino.DocObjects.Tables.ObjectTable.DeleteGrips(Rhino.DocObjects.RhinoObject,System.Collections.Generic.IEnumerable{System.Int32})
Deletes one or more grip objects.
owner: The owner of the grip objects.
gripIndices: The indices of the grip objects to delete.
Returns: The number of successfully deleted grip objects.

Rhino.DocObjects.Tables.ObjectTable.Replace(Rhino.DocObjects.ObjRef,Rhino.Geometry.Hatch)
Replaces one object with new hatch object.
objref:
Reference to old object to be replaced. The object objref.Object() will be deleted.
hatch: new hatch to be added. The hatch is copied.
Returns: true if successful.

Rhino.DocObjects.Tables.ObjectTable.Replace(System.Guid,Rhino.Geometry.Hatch)
Replaces one object with new hatch object.
objectId: Id of object to be replaced.
hatch: new hatch to be added. The hatch is copied.
Returns: true if successful.

Rhino.DocObjects.Tables.ObjectTable.ReplaceInstanceObject(System.Guid,System.Int32)
Replaces the underlying instance definition of an instance object.
objectId: Id of the instance object to be replaced.
instanceDefinitionIndex: The index of the new instance definition to use.
Returns: true if successful.

Rhino.DocObjects.Tables.ObjectTable.ReplaceInstanceObject(Rhino.DocObjects.ObjRef,System.Int32)
Replaces the underlying instance definition of an instance object.
objref: Reference to the instance object to be replaced. The objref.Object() will be deleted.
instanceDefinitionIndex: The index of the new instance definition to use.
Returns: true if successful.