Rhino.DocObjects.Tables.GroupTableEventArgs.Document
The document in which the event occurred.

Rhino.DocObjects.Tables.GroupTableEventArgs.EventType
The event type.

Rhino.DocObjects.Tables.GroupTableEventArgs.GroupIndex
The index of the Group that has changed.

Rhino.DocObjects.Tables.GroupTableEventArgs.NewState
The Group that has changed.

Rhino.DocObjects.Tables.GroupTableEventArgs.OldState
If the event is GroupTableEventType.Modified, then the old Group.