Rhino.ApplicationSettings.CurvatureAnalysisSettings.GetDefaultState
Gets the factory settings of the application.

Rhino.ApplicationSettings.CurvatureAnalysisSettings.GetCurrentState
Gets the current settings of the application.

Rhino.ApplicationSettings.CurvatureAnalysisSettings.RestoreDefaults
Commits the default settings as the current settings.

Rhino.ApplicationSettings.CurvatureAnalysisSettings.UpdateFromState(Rhino.ApplicationSettings.CurvatureAnalysisSettingsState)
Sets all settings to a particular defined joined state.
state: The particular state.

Rhino.ApplicationSettings.CurvatureAnalysisSettings.GaussRange
Gets or sets the Gaussian curvature range.

Rhino.ApplicationSettings.CurvatureAnalysisSettings.MeanRange
Gets or sets the Mean curvature range.

Rhino.ApplicationSettings.CurvatureAnalysisSettings.MinRadiusRange
Gets or sets the Minimum Radius curvature range.

Rhino.ApplicationSettings.CurvatureAnalysisSettings.MaxRadiusRange
Gets or sets the Maximum Radius curvature range.

Rhino.ApplicationSettings.CurvatureAnalysisSettings.Style
Gets or sets the curvature analysis style.

Rhino.ApplicationSettings.CurvatureAnalysisSettings.CalculateCurvatureAutoRange(System.Collections.Generic.IEnumerable{Rhino.Geometry.Mesh},Rhino.ApplicationSettings.CurvatureAnalysisSettingsState@)
meshes:
settings:
Returns: