Rhino.Geometry.Brep.ChangeSeam(Rhino.Geometry.BrepFace,System.Int32,System.Double,System.Double)
Change the seam of a closed trimmed surface.
face: A Brep face with a closed underlying surface.
direction: The parameter direction (0 = U, 1 = V). The face's underlying surface must be closed in this direction.
parameter: The parameter at which to place the seam.
tolerance: Tolerance used to cut up surface.
Returns: A new Brep that has the same geoemtry as the face with a relocated seam if successful, or null on failure.

Rhino.Geometry.Brep.CreateBaseballSphere(Rhino.Geometry.Point3d,System.Double,System.Double)
Creates a brep representation of the sphere with two similar trimmed NURBS surfaces, and no singularities.
center: The center of the sphere.
radius: The radius of the sphere.
tolerance:
Used in computing 2d trimming curves. If >= 0.0, then the max of
ON_0.0001 * radius and RhinoMath.ZeroTolerance will be used.
Returns: A new brep, or null on error.

Rhino.Geometry.Brep.CreateDevelopableLoft(Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Boolean,System.Boolean,System.Int32)
Creates a single developable surface between two curves.
crv0: The first rail curve.
crv1: The second rail curve.
reverse0: Reverse the first rail curve.
reverse1: Reverse the second rail curve
density: The number of rulings across the surface.
Returns: The output Breps if successful, otherwise an empty array.

Rhino.Geometry.Brep.CreateDevelopableLoft(Rhino.Geometry.NurbsCurve,Rhino.Geometry.NurbsCurve,System.Collections.Generic.IEnumerable{Rhino.Geometry.Point2d})
Creates a single developable surface between two curves.
rail0: The first rail curve.
rail1: The second rail curve.
fixedRulings:
Rulings define lines across the surface that define the straight sections on the developable surface,
where rulings[i].X = parameter on first rail curve, and rulings[i].Y = parameter on second rail curve.
Note, rulings will be automatically adjusted to minimum twist.
Returns: The output Breps if successful, otherwise an empty array.

Rhino.Geometry.Brep.CreateFromBox(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d})
Constructs new brep from 8 corner points.
corners:
8 points defining the box corners arranged as the vN labels indicate.
v7_______e6____v6
|\             |\
| e7           | e5
|  \ ______e4_____\
e11 v4         |   v5
|   |        e10   |
|   |          |   |
v3--|---e2----v2   e9
\  e8          \  |
e3 |            e1|
\|             \|
v0_____e0______v1
Returns: A new brep, or null on error.

Rhino.Geometry.Brep.CreateFromSphere(Rhino.Geometry.Sphere)
Constructs a Brep definition of a sphere.
sphere: The input sphere provides the orienting plane and radius.
Returns: A Brep if successful, null on error.

Rhino.Geometry.Brep.CreateQuadSphere(Rhino.Geometry.Sphere)
Constructs a Brep definition of a quad sphere.
sphere: The input sphere provides the orienting plane and radius.
Returns: A Brep if successful, null on error.

Rhino.Geometry.Brep.CreateFromCone(Rhino.Geometry.Cone,System.Boolean)
Constructs a Brep representation of the cone with a single
face for the cone, an edge along the cone seam,
and vertices at the base and apex ends of this seam edge.
The optional cap is a single face with one circular edge
starting and ending at the base vertex.
cone: A cone value.
capBottom: if true the base of the cone should be capped.
Returns: A Brep if successful, null on error.

Rhino.Geometry.Brep.CreateFromRevSurface(Rhino.Geometry.RevSurface,System.Boolean,System.Boolean)
Constructs a brep form of a surface of revolution.
surface: The surface of revolution.
capStart:
if true, the start of the revolute is not on the axis of revolution,
and the surface of revolution is closed, then a circular cap will be
added to close of the hole at the start of the revolute.
capEnd:
if true, the end of the revolute is not on the axis of revolution,
and the surface of revolution is closed, then a circular cap will be
added to close of the hole at the end of the revolute.
Returns: A Brep if successful, null on error.

Rhino.Geometry.Brep.CreateFromSweep(Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Boolean,System.Double)
Sweep1 function tht fits a surface through a profile curve that define the surface cross-sections
and one curve that defines a surface edge.
///
rail: Rail to sweep shapes along
shape: Shape curve
closed: Only matters if shape is closed
tolerance: Tolerance for fitting surface and rails
Returns: Array of Brep sweep results
Remarks:
If you are not producing the sweep results that you are after, then
use the SweepOneRail class with options to generate the swept geometry.

Rhino.Geometry.Brep.CreateFromSweep(Rhino.Geometry.Curve,System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.Boolean,System.Double)
Sweep1 function tht fits a surface through a profile curve that define the surface cross-sections
and one curve that defines a surface edge.
rail: Rail to sweep shapes along
shapes: Shape curves
closed: Only matters if shapes are closed
tolerance: Tolerance for fitting surface and rails
Returns: Array of Brep sweep results
Remarks:
If you are not producing the sweep results that you are after, then
use the SweepOneRail class with options to generate the swept geometry.

Rhino.Geometry.Brep.CreateFromSweepSegmented(Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Boolean,System.Double)
Sweep1 function tht fits a surface through a profile curve that define the surface cross-sections
and one curve that defines a surface edge. The Segmented version breaks the rail at curvature kinks
and sweeps each piece separately, then put the results together into a Brep.
rail: Rail to sweep shapes along
shape: Shape curve
closed: Only matters if shape is closed
tolerance: Tolerance for fitting surface and rails
Returns: Array of Brep sweep results
Remarks:
If you are not producing the sweep results that you are after, then
use the SweepOneRail class with options to generate the swept geometry.

Rhino.Geometry.Brep.CreateFromSweepSegmented(Rhino.Geometry.Curve,System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.Boolean,System.Double)
Sweep1 function tht fits a surface through a series of profile curves that define the surface cross-sections
and one curve that defines a surface edge. The Segmented version breaks the rail at curvature kinks
and sweeps each piece separately, then put the results together into a Brep.
rail: Rail to sweep shapes along
shapes: Shape curves
closed: Only matters if shapes are closed
tolerance: Tolerance for fitting surface and rails
Returns: Array of Brep sweep results
Remarks:
If you are not producing the sweep results that you are after, then
use the SweepOneRail class with options to generate the swept geometry.

Rhino.Geometry.Brep.CreateFromSweepInParts(Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.Collections.Generic.IEnumerable{Rhino.Geometry.Point2d},System.Boolean,System.Double)
Makes a 2 rail sweep.  Like CreateFromSweep but the result is split where parameterization along a rail changes abruptly
rail1: Rail to sweep shapes along
rail2: Rail to sweep shapes along
shapes: Shape curves
rail_params: Shape parameters
closed: Only matters if shapes are closed
tolerance: Tolerance for fitting surface and rails
Returns: Array of Brep sweep results

Rhino.Geometry.Brep.CreateFromTaperedExtrudeWithRef(Rhino.Geometry.Curve,Rhino.Geometry.Vector3d,System.Double,System.Double,Rhino.Geometry.Plane,System.Double)
Creates one or more Breps by extruding a curve a distance along an axis with draft angle.
curve: The curve to extrude.
direction: The extrusion direction.
distance: The extrusion distance.
draftAngle: The extrusion draft angle in radians.
plane:
The end of the extrusion will be parallel to this plane, and "distance" from the plane's origin.
The plane's origin is generally be a point on the curve. For planar curves, a natural choice for the
plane's normal direction will be the normal direction of the curve's plane. In any case,
plane.Normal = direction may make sense.
tolerance: The intersecting and trimming tolerance.
Returns: An array of Breps if successful.

Rhino.Geometry.Brep.CreateCurvatureAnalysisMesh(Rhino.Geometry.Brep,Rhino.ApplicationSettings.CurvatureAnalysisSettingsState)
Create an array of analysis meshes for the brep using the specified settings.
Meshes aren't set on the brep.
brep:
state:  CurvatureAnalysisSettingsState
Returns: true if meshes were created

Rhino.Geometry.Brep.Vertices
Gets the brep vertices list accessor.

Rhino.Geometry.Brep.FindCoincidentBrepComponents(Rhino.Geometry.Point3d,System.Double,System.Int32[]@,System.Int32[]@,System.Int32[]@)
Find the indices of all brep faces, edges and vertices that are within tolerance of a test-point.
point: Test point.
tolerance: Coincidence tolerance.
faces: Array of BrepFace indices.
edges: Array of BrepEdge indices.
vertices: Array of BrepVertex indices.

Rhino.Geometry.Brep.AssignIndices(System.Int32[],System.Boolean[])
Set all indexed values in a bool array to true.
Utility function for above.
ints: Array of indices.
bools: Bool array.

Rhino.Geometry.Brep.MergeCoplanarFaces(System.Double)
Merges adjacent coplanar faces into single faces.
tolerance:
Tolerance for determining when edges are adjacent.
When in doubt, use the document's ModelAbsoluteTolerance property.
Returns: true if faces were merged, false if no faces were merged.

Rhino.Geometry.Brep.MergeCoplanarFaces(System.Double,System.Double)
Merges adjacent coplanar faces into single faces.
tolerance:
Tolerance for determining when edges are adjacent.
When in doubt, use the document's ModelAbsoluteTolerance property.
angleTolerance:
Angle tolerance, in radians, for determining when faces are parallel.
When in doubt, use the document's ModelAngleToleranceRadians property.
Returns: true if faces were merged, false if no faces were merged.

Rhino.Geometry.Brep.Split(Rhino.Geometry.Brep,System.Double)
Splits a Brep into pieces using a Brep as a cutter.
cutter: The Brep to use as a cutter.
intersectionTolerance: The tolerance with which to compute intersections.
Returns: A new array of Breps. This array can be empty.

Rhino.Geometry.Brep.Split(Rhino.Geometry.Brep,System.Double,System.Boolean@)
Splits a Brep into pieces using a Brep as a cutter.
cutter: The Brep to use as a cutter.
intersectionTolerance: The tolerance with which to compute intersections.
toleranceWasRaised:
Set to true if the split failed at intersectionTolerance but succeeded
when the tolerance was increased to twice intersectionTolerance.
Returns: A new array of Breps. This array can be empty.

Rhino.Geometry.Brep.Split(System.Collections.Generic.IEnumerable{Rhino.Geometry.Brep},System.Double)
Splits a Brep into pieces using Breps as cutters.
cutters: One or more Breps to use as cutters.
intersectionTolerance: The tolerance with which to compute intersections.
Returns: A new array of Breps. This array can be empty.

Rhino.Geometry.Brep.Split(System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.Double)
Splits a Brep into pieces using curves, at least partially on the Brep, as cutters.
cutters: The splitting curves. Only the portion of the curve on the Brep surface will be used for cutting.
intersectionTolerance: The tolerance with which to compute intersections.
Returns: A new array of Breps. This array can be empty.

Rhino.Geometry.Brep.Split(System.Collections.Generic.IEnumerable{Rhino.Geometry.GeometryBase},Rhino.Geometry.Vector3d,System.Boolean,System.Double)
Splits a Brep into pieces using a combination of curves, to be extruded, and Breps as cutters.
cutters: The curves, surfaces, faces and Breps to be used as cutters. Any other geometry is ignored.
normal: A construction plane normal, used in deciding how to extrude a curve into a cutter.
planView: Set true if the assume view is a plan, or parallel projection, view.
intersectionTolerance: The tolerance with which to compute intersections.
Returns: A new array of Breps. This array can be empty.
Remarks:
A Curve in cutters is extruded to produce a surface to use as a cutter. The extrusion direction is choosen, as in the Rhino Split command,
based on the properties of the active view. In particular the construction plane Normal and whether the active view is a plan view,
a parallel projection with construction plane normal as the view direction. If planView is false and the curve is planar then the curve
is extruded perpendicular to the curve, otherwise the curve is extruded in the normal direction.

Rhino.Geometry.Brep.Repair(System.Double)
Fills in missing or fixes incorrect component information from a Brep.
Useful when reading Brep information from other file formats that do not
provide as complete of a Brep definition as requried by Rhino.
tolerance: The repair tolerance. When in doubt, use the document's model absolute tolerance.
Returns: True on success.

Rhino.Geometry.Brep.RemoveHoles(System.Double)
Remove all inner loops, or holes, in a Brep.
tolerance: The tolerance. When in doubt, use the document's model absolute tolerance.
Returns: The Brep without holes if successful, null otherwise.

Rhino.Geometry.Brep.RemoveHoles(System.Collections.Generic.IEnumerable{Rhino.Geometry.ComponentIndex},System.Double)
Removes inner loops, or holes, in a Brep.
loops: A list of BrepLoop component indexes, where BrepLoop.LoopType == Rhino.Geometry.BrepLoopType.Inner.
tolerance: The tolerance. When in doubt, use the document's model absolute tolerance.
Returns: The Brep without holes if successful, null otherwise.