Rhino.Geometry.Mesh.CreateIcoSphere(Rhino.Geometry.Sphere,System.Int32)
Constructs a icospherical mesh. A mesh icosphere differs from a standard
UV mesh sphere in that it's vertices are evenly distributed. A mesh icosphere
starts from an icosahedron (a regular polyhedron with 20 equilateral triangles).
It is then refined by splitting each triangle into 4 smaller triangles.
This splitting can be done several times.
sphere: The input sphere provides the orienting plane and radius.
subdivisions:
The number of times you want the faces split, where 0  <= subdivisions <= 7.
Note, the total number of mesh faces produces is: 20 * (4 ^ subdivisions)
Returns: A welded mesh icosphere if successful, or null on failure.

Rhino.Geometry.Mesh.CreateQuadSphere(Rhino.Geometry.Sphere,System.Int32)
Constructs a quad mesh sphere. A quad mesh sphere differs from a standard
UV mesh sphere in that it's vertices are evenly distributed. A quad mesh sphere
starts from a cube (a regular polyhedron with 6 square sides).
It is then refined by splitting each quad into 4 smaller quads.
This splitting can be done several times.
sphere: The input sphere provides the orienting plane and radius.
subdivisions:
The number of times you want the faces split, where 0  <= subdivisions <= 8.
Note, the total number of mesh faces produces is: 6 * (4 ^ subdivisions)
Returns: A welded quad mesh sphere if successful, or null on failure.

Rhino.Geometry.Mesh.CreateFromCone(Rhino.Geometry.Cone,System.Int32,System.Int32)
Constructs a solid mesh cone.
cone:
vertical: Number of faces in the top-to-bottom direction.
around: Number of faces around the cone.
Throws System.ArgumentException: Thrown when cone is invalid.
Returns: A valid mesh if successful.

Rhino.Geometry.Mesh.CreateFromCone(Rhino.Geometry.Cone,System.Int32,System.Int32,System.Boolean)
Constructs a mesh cone.
cone:
vertical: Number of faces in the top-to-bottom direction.
around: Number of faces around the cone.
solid: If false the mesh will be open with no faces on the circular planar portion.
Throws System.ArgumentException: Thrown when cone is invalid.
Returns: A valid mesh if successful.

Rhino.Geometry.Mesh.CreateFromSurface(Rhino.Geometry.Surface)
Constructs a mesh from a surface
surface: Surface to approximate
Returns: New mesh representing the surface

Rhino.Geometry.Mesh.CreateFromSurface(Rhino.Geometry.Surface,Rhino.Geometry.MeshingParameters)
Constructs a mesh from a surface
surface: Surface to approximate
meshingParameters: settings used to create the mesh
Returns: New mesh representing the surface

Rhino.Geometry.Mesh.Volume
Compute volume of the mesh.
Returns: Volume of the mesh.

Rhino.Geometry.Mesh.Smooth(System.Double,System.Boolean,System.Boolean,System.Boolean,System.Boolean,Rhino.Geometry.SmoothingCoordinateSystem)
Smooths a mesh by averaging the positions of mesh vertices in a specified region.
smoothFactor: The smoothing factor, which controls how much vertices move towards the average of the neighboring vertices.
bXSmooth: When true vertices move in X axis direction.
bYSmooth: When true vertices move in Y axis direction.
bZSmooth: When true vertices move in Z axis direction.
bFixBoundaries: When true vertices along naked edges will not be modified.
coordinateSystem: The coordinates to determine the direction of the smoothing.
Returns: True if successful, false otherwise.

Rhino.Geometry.Mesh.Smooth(System.Double,System.Boolean,System.Boolean,System.Boolean,System.Boolean,Rhino.Geometry.SmoothingCoordinateSystem,Rhino.Geometry.Plane)
Smooths a mesh by averaging the positions of mesh vertices in a specified region.
smoothFactor: The smoothing factor, which controls how much vertices move towards the average of the neighboring vertices.
bXSmooth: When true vertices move in X axis direction.
bYSmooth: When true vertices move in Y axis direction.
bZSmooth: When true vertices move in Z axis direction.
bFixBoundaries: When true vertices along naked edges will not be modified.
coordinateSystem: The coordinates to determine the direction of the smoothing.
plane: If SmoothingCoordinateSystem.CPlane specified, then the construction plane.
Returns: True if successful, false otherwise.

Rhino.Geometry.Mesh.Smooth(System.Collections.Generic.IEnumerable{System.Int32},System.Double,System.Boolean,System.Boolean,System.Boolean,System.Boolean,Rhino.Geometry.SmoothingCoordinateSystem,Rhino.Geometry.Plane)
Smooths part of a mesh by averaging the positions of mesh vertices in a specified region.
vertexIndices: The mesh vertex indices that specify the part of the mesh to smooth.
smoothFactor: The smoothing factor, which controls how much vertices move towards the average of the neighboring vertices.
bXSmooth: When true vertices move in X axis direction.
bYSmooth: When true vertices move in Y axis direction.
bZSmooth: When true vertices move in Z axis direction.
bFixBoundaries: When true vertices along naked edges will not be modified.
coordinateSystem: The coordinates to determine the direction of the smoothing.
plane: If SmoothingCoordinateSystem.CPlane specified, then the construction plane.
Returns: True if successful, false otherwise.

Rhino.Geometry.Mesh.UnweldEdge(System.Collections.Generic.IEnumerable{System.Int32},System.Boolean)
Adds creases to a smooth mesh by creating coincident vertices along selected edges.
edgeIndices: An array of mesh topology edge indices.
modifyNormals:
If true, the vertex normals on each side of the edge take the same value as the face to which they belong, giving the mesh a hard edge look.
If false, each of the vertex normals on either side of the edge is assigned the same value as the original normal that the pair is replacing, keeping a smooth look.
Returns: true if successful, false otherwise.

Rhino.Geometry.Mesh.Append(System.Collections.Generic.IEnumerable{Rhino.Geometry.Mesh})
Append a list of meshes. This function is much more efficient than making
repeated calls to Mesh.Append(Mesh) when lots of meshes are being joined
into a single large mesh.
meshes: Meshes to append to this one.

Rhino.Geometry.Mesh.Offset(System.Double,System.Boolean,Rhino.Geometry.Vector3d)
Makes a new mesh with vertices offset a distance along the direction parameter.
Optionally, based on the value of solidify, adds the input mesh and a ribbon of faces along any naked edges.
If solidify is false it acts exactly as the Offset(distance) function.
distance: A distance value.
solidify: true if the mesh should be solidified.
direction: Direction of offset for all vertices.
Returns: A new mesh on success, or null on failure.

Rhino.Geometry.Mesh.Reduce(System.Int32,System.Boolean,System.Int32,System.Boolean,System.Boolean)
Reduce polygon count
desiredPolygonCount: desired or target number of faces
allowDistortion:
If true mesh appearance is not changed even if the target polygon count is not reached
accuracy: Integer from 1 to 10 telling how accurate reduction algorithm
to use. Greater number gives more accurate results
normalizeSize: If true mesh is fitted to an axis aligned unit cube until reduction is complete
threaded:
If True then will run computation inside a worker thread and ignore any provided CancellationTokens and ProgressReporters.
If False then will run on main thread.
Returns: True if mesh is successfully reduced and false if mesh could not be reduced for some reason.

Rhino.Geometry.Mesh.Reduce(System.Int32,System.Boolean,System.Int32,System.Boolean,System.Threading.CancellationToken,System.IProgress{System.Double},System.String@,System.Boolean)
Reduce polygon count
desiredPolygonCount: desired or target number of faces
allowDistortion:
If true mesh appearance is not changed even if the target polygon count is not reached
accuracy: Integer from 1 to 10 telling how accurate reduction algorithm
to use. Greater number gives more accurate results
normalizeSize: If true mesh is fitted to an axis aligned unit cube until reduction is complete
cancelToken:
progress:
problemDescription:
threaded:
If True then will run computation inside a worker thread and ignore any provided CancellationTokens and ProgressReporters.
If False then will run on main thread.
Returns: True if mesh is successfully reduced and false if mesh could not be reduced for some reason.

Rhino.Geometry.Mesh.Reduce(Rhino.Geometry.ReduceMeshParameters,System.Boolean)
Reduce polygon count
parameters: Parameters
threaded:
If True then will run computation inside a worker thread and ignore any provided CancellationTokens and ProgressReporters.
If False then will run on main thread.
Returns: True if mesh is successfully reduced and false if mesh could not be reduced for some reason.

Rhino.Geometry.Mesh.CreateFromLines(Rhino.Geometry.Curve[],System.Int32,System.Double)
Creates a mesh by analizing the edge structure. Input lines could be from the extraction
of edges from an original mesh.
lines: Lines to use for computation. If curve is non-linear, curve ends are used
maxFaceValence: The maximum number of edges per face.
tolerance: The distance after which two end points of lines are considered
coincident.
Returns: A new mesh, or null if no mesh is constructed.