Rhino.DocObjects.ObjRef.InstanceDefinitionPart
If subobject selection is enabled and a piece of an instance reference
is selected, this will return the selected piece.
Returns:

Rhino.DocObjects.ObjRef.SelectionViewDetailSerialNumber
If the object was interactively selected in a page space detail
view, then SelectionViewDetailSerialNumber() returns the CRhinoObject
serial number of the detail view object.  Use SelectionView()
to get the page view that contains the detail view object.
If SelectionViewDetailSerialNumber() returns 0, then the selection
did not happen in a detail view.
Returns:

Rhino.DocObjects.ObjRef.SelectionView
If the object was interactively selected in a particular viewport, then
SelectionView() returns the view where the object was selected.
Returns: