Rhino.Geometry.OrdinateDimension.Create(Rhino.DocObjects.DimensionStyle,Rhino.Geometry.Plane,Rhino.Geometry.OrdinateDimension.MeasuredDirection,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Double,System.Double)
Initialize Dimension parameters
dimStyle: Dimension's AnnotationStyle
plane: Dimension;s plane
direction: MeasuredDirection.XAxis or MeasuredDirection.YAxis
basepoint: Dimension';s basepoint
defpoint: Dimension's definition point
leaderpoint: Point at tail of leader
kinkoffset1: Distance to first jog
kinkoffset2: Distance to second jog
Returns:

Rhino.Geometry.OrdinateDimension.AdjustFromPoints(Rhino.Geometry.Plane,Rhino.Geometry.OrdinateDimension.MeasuredDirection,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Double,System.Double)
Update Dimension geometry from point locations
plane: Dimension's plane
direction: MeasuredDirection.XAxis or MeasuredDirection.YAxisw
basepoint: Dimension';s basepoint
defpoint: Dimension's definition point
leaderpoint: Point at tail of leader
kinkoffset1: Distance to first jog
kinkoffset2: Distance to second jog
Returns:

Rhino.Geometry.OrdinateDimension.Get3dPoints(Rhino.Geometry.Point3d@,Rhino.Geometry.Point3d@,Rhino.Geometry.Point3d@,Rhino.Geometry.Point3d@,Rhino.Geometry.Point3d@)
Get locations of dimension's 3d points
basepoint: Dimension',s basepoint
defpoint: Dimension's definition point
leaderpoint: Point at tail of leader
kinkpoint1: Point at first jog
kinkpoint2: Point at second jog
Returns: