Rhino.Render.RenderSettings.TransparentBackground
Gets or sets whether rendering should be done with transparent background.

Rhino.Render.RenderSettings.NamedView
Get or set the given named view

Rhino.Render.RenderSettings.Snapshot
Set os get the given snapshot view

Rhino.Render.RenderSettings.SpecificViewport
Set or get the given specific viewport

Rhino.Render.RenderSettings.RenderSource
Gets or sets the render source Rhino.Render.RenderSettings.RenderingSources enumeration.