Rhino.Geometry.PointCloud.PointAt(System.Int32)
Returns the location of the point at a specific index.
index: The index.
Returns:

Rhino.Geometry.PointCloud.AsReadOnlyListOfPoints
Returns an enumerator and list indexer over point cloud locations.
Returns: The read-only list. This is a reference to the present point cloud.