Rhino.FileIO.NameHash.#ctor(System.String,System.Guid)
Creates a new NameHash, representing a piece of text.
name: A name. This can be null and can refer to a nonexisting path.
parentId: The id of the parent layer. This is only useful with layers.
Returns: A new hash

Rhino.FileIO.NameHash.#ctor(System.String,System.Guid,Rhino.DocObjects.ModelComponentType)
Creates a new NameHash, representing a piece of text.
name: A name. This can be null and can refer to a nonexisting path.
parentId: The id of the parent layer. This is only useful with layers.
type: Calls Rhino.DocObjects.ModelComponent.ModelComponentTypeIgnoresCase(Rhino.DocObjects.ModelComponentType) to determine if case should be used in search.
Returns: A new hash

Rhino.FileIO.NameHash.#ctor(System.String,System.Guid,System.Boolean)
Creates a new NameHash, representing a piece of text.
name: A name. This can be null and can refer to a nonexisting path.
parentId: The id of the parent layer. This is only useful with layers.
ignoreCase: All manifest searches currently ignore case, except for groups.
Returns: A new hash