Rhino.Geometry.HiddenLineDrawingPoint
Points generated from source objects which coorespond to point and point cloud source objects.

Rhino.Geometry.HiddenLineDrawingPoint.SourceObject
Return the source object that this point came from.

Rhino.Geometry.HiddenLineDrawingPoint.SourceObjectComponentIndex
Component of source object part that generated this curve.

Rhino.Geometry.HiddenLineDrawingPoint.ClippingPlaneIndex
Index into HiddenLineDrawing.ClippingPlanes when SilhouetteType == SilhouetteType.SectionCut.

Rhino.Geometry.HiddenLineDrawingPoint.Location
Returns the location of this object in HiddenLineDrawing coordinates.

Rhino.Geometry.HiddenLineDrawingPoint.Index
Index of this object in HiddenLineDrawing.Points.

Rhino.Geometry.HiddenLineDrawingPoint.PointVisibility
Returns the point's visibility