Rhino.Geometry.Collections.NurbsSurfacePointList.PointSize
Returns the control point size, or the number of doubles per control point.
For rational curves, PointSize = Surface.Dimension + 1.
For non-rational curves, PointSize = Surface.Dimension.