Rhino.Runtime.NamedParametersEventArgs.TryGetString(System.String,System.String@)
Try to get a string value for a given key name
name:
value:
Returns:

Rhino.Runtime.NamedParametersEventArgs.SetString(System.String,System.String)
Set a string value for a given key name
name:
value:

Rhino.Runtime.NamedParametersEventArgs.TryGetBool(System.String,System.Boolean@)
Try to get a bool value for a given key name
name:
value:
Returns:

Rhino.Runtime.NamedParametersEventArgs.SetBool(System.String,System.Boolean)
Set a bool value for a given key name
name:
value:

Rhino.Runtime.NamedParametersEventArgs.TryGetInt(System.String,System.Int32@)
Try to get an int value for a given key name
name:
value:
Returns:

Rhino.Runtime.NamedParametersEventArgs.SetInt(System.String,System.Int32)
Set an int value for a given key name
name:
value:

Rhino.Runtime.NamedParametersEventArgs.TryGetDouble(System.String,System.Double@)
Try to get a double value for a given key name
name:
value:
Returns:

Rhino.Runtime.NamedParametersEventArgs.SetDouble(System.String,System.Double)
Set a double value for a given key name
name:
value: