Rhino.Runtime.ZooClientParameters.#ctor(System.Guid,System.Guid,System.String,System.Int32,Rhino.PlugIns.LicenseCapabilities,System.String,System.String,System.Object,Rhino.Runtime.LicenseTypes,Rhino.PlugIns.ValidateProductKeyDelegate,Rhino.PlugIns.OnLeaseChangedDelegate,Rhino.PlugIns.VerifyLicenseKeyDelegate,Rhino.PlugIns.VerifyPreviousVersionLicenseDelegate)
ZooClientParameters Constructor
productGuid: Guid used by ZooClient to identify the plug-in requesting a license from ZooClient. This Guid may be used by different versions of the
plug-in. If different licenses are used by different versions of the plug-in, the plug-in must also specify a LicenseGuid.
licenseGuid: Guid used by ZooClient to identify the license saved by ZooClient. This differs from ProductGuid because different versions of a plug-in
with the same Plug-in ID may need different licenses.
productTitle: Title of product displayed in user interface
productBuildType:
capabilities: Enum that declares whether this product supports evalation, licensing, purchasing, and cloud zoo
licenseEntryTextMask: Text mask used to limit input. EG: RH50-AAAA-AAAA-AAAA-AAAA-AAAA
productPath: Full path to DLL implementing product
parentWindow: Object used to parent UI DLLs
selectedLicenseType: Type of license currently used by this product
validateProductKey: Delegate called to validate the structure of a license key
onLeaseChangedDelegate: Delegate called when a cloud zoo lease changes
verifyLicenseKeyDelegate: Delegate called to verify the structure of a license key
verifyPreviousVersionLicenseKeyDelegate: Delegate called to verify the structure of an upgrade license key

Rhino.Runtime.ZooClientParameters.ProductGuid
Guid used by ZooClient to identify the plug-in requesting a license from ZooClient. This Guid may be used by different versions of the
plug-in. If different licenses are used by different versions of the plug-in, the plug-in must also specify a LicenseGuid.

Rhino.Runtime.ZooClientParameters.LicenseGuid
Guid used by ZooClient to identify the license saved by ZooClient. This differs from ProductGuid because different versions of a plug-in
with the same Plug-in ID may need different licenses.