Rhino.UI.PanelSystem.OnShowPanelCallback(System.Guid,System.Guid,System.UInt32,System.UInt32)
This has morphed into a message proc, was originally a call back for
the OnShow virtual method but was enhanced to handle IsCreated as well
panelTypeGuid:
hostId:
documentSerailNumber:
state:
Returns: