Rhino.PlugInSettings.ToStream(Rhino.PersistentSettings,System.Collections.Generic.Dictionary{System.String,Rhino.PersistentSettings})
Write the specified settings to a MemoryStream
settings:
The settings to write, if null the XML document's settins section will be empty
otherwise; it will contain any settings that are not equal to thier default value.
commandSettings:
Should be null when writing window positions XML file.  If writing plug-in settings
then pass the commands dictionary.
Returns:
Returns a stream containg the settings XML document on success otherwise; null.