Rhino.Geometry.MeshExtruder.#ctor(Rhino.Geometry.Mesh,System.Collections.Generic.IEnumerable{Rhino.Geometry.ComponentIndex})
Construct object to extrude given mesh faces, edges and ngons.
inputMesh: Mesh to use as starting point. Will not be modified.
componentIndices: Mesh faces, edges and ngons to extrude.

Rhino.Geometry.MeshExtruder.Dispose
Dispose of this object and any unmanaged memory associated with it.

Rhino.Geometry.MeshExtruder.PreviewLines
Gets Line objects to preview extruded mesh.

Rhino.Geometry.MeshExtruder.ExtrudedMesh(Rhino.Geometry.Mesh@)
Creates new extruded mesh. Returns true if any edges or faces were extruded.
extrudedMeshOut: Extruded mesh

Rhino.Geometry.MeshExtruder.Transform
Transform of extrusion

Rhino.Geometry.MeshExtruder.UVN
Whether or not to perform extrude in UVN basis.

Rhino.Geometry.MeshExtruder.EdgeBasedUVN
Edge based UVN defines UVN directions according to boundary edge directions

Rhino.Geometry.MeshExtruder.KeepOriginalFaces
Whether or not to keep original faces.

Rhino.Geometry.MeshExtruder.TextureCoordinateMode
Mode for creating texture coordinates for extruded areas

Rhino.Geometry.MeshExtruder.SurfaceParameterMode
Mode for creating surface parameters for extruded areas

Rhino.Geometry.MeshExtruder.FaceDirectionMode
Face direction mode determines how faces are oriented