Rhino.DocObjects.Tables.LayerTable.Modify(Rhino.DocObjects.Layer,System.Int32,System.Boolean)
Modifies layer settings.
newSettings: This information is copied.
layerIndex:
zero based index of layer to set.  This must be in the range 0 <= layerIndex < LayerTable.Count.
quiet: if false, information message boxes pop up when illegal changes are attempted.
Returns:
true if successful. false if layerIndex is out of range or the settings attempt
to lock or hide the current layer.

Rhino.DocObjects.Tables.LayerTable.Modify(Rhino.DocObjects.Layer,System.Guid,System.Boolean)
Modifies layer settings.
newSettings: This information is copied.
layerId:
Id of layer.
quiet: if false, information message boxes pop up when illegal changes are attempted.
Returns:
true if successful. false if layerIndex is out of range or the settings attempt
to lock or hide the current layer.