Rhino.Render.ChangeQueue.ChangeQueue.#ctor(System.Guid,System.UInt32,Rhino.DocObjects.ViewInfo,System.Boolean)
Construct a new ChangeQueue from the given document
pluginId: Id of plugin instantiating ChangeQueue
docRuntimeSerialNumber:
viewinfo:
bRespectDisplayPipelineAttributes: Determines whether the display pipeline attributes for this viewport should be taken into account when supplying data.	If you are
using this queue to populate a scene for the "Render" command, set this to false.	If you are using it to draw a realtime preview, you will probably want to set it to true.

Rhino.Render.ChangeQueue.ChangeQueue.#ctor(System.Guid,System.UInt32,Rhino.DocObjects.ViewInfo,Rhino.Display.DisplayPipelineAttributes,System.Boolean,System.Boolean)
Construct a new ChangeQueue from the given document, using given display pipeline attributes.
pluginId: Id of plugin instantiating ChangeQueue
docRuntimeSerialNumber:
viewinfo:
attributes: Display pipeline attributes to use.
bRespectDisplayPipelineAttributes: Determines whether the display pipeline attributes for this viewport should be taken into account when supplying data.	If you are
using this queue to populate a scene for the "Render" command, set this to false.	If you are using it to draw a realtime preview, you will probably want to set it to true.
bNotifyChanges: Determines whether you want to receive updates when the model changes.  If you are rendering for a view capture, print or something similar, you will probably want to set this to false.

Rhino.Render.ChangeQueue.ChangeQueue.DisplayPipelineAttributes
Get the DisplayPipelineAttributes if available, null otherwise