Rhino.Render.DataSources.ContentFactory.NewContent
New Content returns a new content, which is Initialized with the Initialize() function.
The content should be unitilized after use with the Unitialize function.
Returns: