Rhino.Render.CustomRenderMeshProvider.WillBuildCustomMeshes(Rhino.DocObjects.ViewportInfo,Rhino.DocObjects.RhinoObject,System.Guid,System.Boolean)
Determines if custom render meshes will be built for a particular object.
vp: The viewport being rendered.
obj: The Rhino object of interest.  This can be null in the case where document meshes (not associated with any object) are being requested.
requestingPlugIn: UUID of the RDK plug-in requesting the meshes.
preview: Type of mesh to build.
Returns: true if custom meshes will be built.

Rhino.Render.CustomRenderMeshProvider.BoundingBox(Rhino.DocObjects.ViewportInfo,Rhino.DocObjects.RhinoObject,System.Guid,System.Boolean)
Returns a bounding box for the custom render meshes for the given object.
vp: The viewport being rendered.
obj: The Rhino object of interest.  This can be null in the case where document meshes (not associated with any object) are being requested.
requestingPlugIn: UUID of the RDK plug-in requesting the meshes.
preview: Type of mesh to build.
Returns: A bounding box value.