Rhino.Geometry.SubD.SubDVertexTag.Smooth
Must be an interior vertex.
All edges ending at a smooth vertex must be tagged as ON_SubD::EdgeTag::Smooth
and have 2 faces.

Rhino.Geometry.SubD.SubDVertexTag.Crease
Can be an interior or a boundary vertex.
Exactly two edges ending at a crease vertex must be tagged as ON_SubD::EdgeTag::Crease and may
have 1 or 2 faces.
All other edges ending at a crease must be tagged as tagON_SubD::EdgeTag::Smooth and have 2 faces.

Rhino.Geometry.SubD.SubDVertexTag.Corner
Can be an interior, boundary, nonmanifold, or isolated vertex.
The location of a corner vertex is fixed.
The all subdivision points and the limit point are at the initial vertex location.
The edges ending at a corner vertex can be smooth or crease edges.

Rhino.Geometry.SubD.SubDVertexTag.Dart
Must be an interior vertex.
Every edge ending at a dart vertex must have 2 faces.
Exactly one edge ending at a dart vertex must be tagged as ON_SubD::EdgeTag::Crease
and every otherr edge must be tagged as tagON_SubD::EdgeTag::smooth.