Rhino.Geometry.Vector2f.#ctor(System.Single,System.Single)
Creates an instance.
x: X component.
y: Y component.

Rhino.Geometry.Vector2f.SquareLength
Returns the square of the length of this vector.
This method does not check for the validity of its inputs.

Rhino.Geometry.Vector2f.IsValid
Returns an indication regarding the validity of this vector.

Rhino.Geometry.Vector2f.op_Subtraction(Rhino.Geometry.Vector2f,Rhino.Geometry.Vector2f)
Computes the difference between two vectors.
a: First vector.
b: Second vector.
Returns: The difference.