Rhino.UI.Panels.EtoPanelStyleName
Style applied to Eto controls hosted by the Rhino.UI.Panels and
Rhino.UI.ObjectProperties systems.
The name of the eto panel style.

Rhino.UI.Panels.RegisterPanel(Rhino.PlugIns.PlugIn,System.Type,System.String,System.Drawing.Icon,Rhino.UI.PanelType)
Call once to register a panel type which will get dynamically created
and embedded in a Rhino docking/floating location.
plugIn:
Plug-in restringing the panel
type:
Type of the control object to be displayed in the panel
caption:
Panel caption also used as a tool-tip.  On Windows the panel may be
displayed using the icon, caption or both.  On Mac the icon will be
used and the caption will be the tool-tip.
icon:
The panel icon.  On Windows the panel may be displayed using the icon,
caption or both.  On Mac the icon will be used and the caption will be
the tool-tip.
panelType:
See Rhino.UI.PanelType

Rhino.UI.Panels.IconSize
Gets the panel icon size in logical units.
The size of the panel icon in logical units.

Rhino.UI.Panels.ScaledIconSize
Gets the panel icon size in pixels with DPI scaling applied.
IconSize times DPI scale

Rhino.UI.Panels.GetPanels(System.Guid,Rhino.RhinoDoc)
Gets the panels.
Returns: The panels.
panelId: Panel identifier.
doc: Document.

Rhino.UI.Panels.GetPanels(System.Guid,System.UInt32)
Gets the panels.
Returns: The panels.
panelId: Panel identifier.
documentRuntimeSerialNumber: Document runtime serial number.

Rhino.UI.Panels.GetPanels``1(System.UInt32)
Gets the panels.
Returns: The panels.
documentRuntimeSerialNumber: Document runtime serial number.
The 1st type parameter.

Rhino.UI.Panels.GetPanels``1(Rhino.RhinoDoc)
Returns:
doc:

Rhino.UI.Panels.IsPanelVisible(System.Guid,System.Boolean)
Check to see if a panel is currently visible, if isSelectedTab
is true then the tab must be the active tab as well.
panelId:
Class Id for the panel to check.
isSelectedTab:
This paramater is ignored on Mac.
If Windows and true the panel must be visible in a container and
if it is a tabbed container it must be the active tab to be true.
Returns:
On Windows:
The return value is demendant on the isSelectedTab value.  If
isSelectedTab is true then the panel must be included in a
visible tabbed container and must also be the active tab to be
true.  If isSelectedTab is false then the panel only has to be
included in a visible tabbed container to be true.
On Mac:
isSelected is ignored and true is returned if the panel appears
in any inspector panel.

Rhino.UI.Panels.IsPanelVisible(System.Type,System.Boolean)
Check to see if a panel is currently visible, if isSelectedTab
is true then the tab must be the active tab as well.
panelType:
Type of panel to check for, this type must include a GUID attribute.
isSelectedTab:
This paramater is ignored on Mac.
If Windows and true the panel must be visible in a container and
if it is a tabbed container it must be the active tab to be true.
Returns:
On Windows:
The return value is demendant on the isSelectedTab value.  If
isSelectedTab is true then the panel must be included in a
visible tabbed container and must also be the active tab to be
true.  If isSelectedTab is false then the panel only has to be
included in a visible tabbed container to be true.
On Mac:
isSelected is ignored and true is returned if the panel appears
in any inspector panel.

Rhino.UI.Panels.FloatPanel(System.Type,Rhino.UI.Panels.FloatPanelMode)
Mac support:
Display the specified panel in a floating window on Mac, the floating
window will only contain the specified panel.
Windows support:
On Windows this will show or hide the floating continer containing the
specified panel.  If the tab is docked with other tabs it will be
floated in a new container.
panelType:
Panel type to show/hide.
mode:
Show, hide or toggle the visibility state of the specified panel
Returns:
Return true if the panel visibility state was changed, false otherwise.

Rhino.UI.Panels.FloatPanel(System.Guid,Rhino.UI.Panels.FloatPanelMode)
Mac support:
Display the specified panel in a floating window on Mac, the floating
window will only contain the specified panel.
Windows support:
On Windows this will show or hide the floating continer containing the
specified panel.  If the tab is docked with other tabs it will be
floated in a new container.
panelTypeId:
Guid for the panel type to show/hide.
mode:
Show, hide or toggle the visibility state of the specified panel
Returns:
Return true if the panel visibility state was changed, false otherwise.

Rhino.UI.Panels.PanelDockBars(System.Guid)
Will always return a empty array in Mac Rhino.  In Windows Rhino it will
look for any panel dock bars that contain the specified panel class Id and
return the dock bar Id's.
panelId:
Panel class Id for of the panel to look for.
Returns:
Always returns Guid.Empty on Mac Rhino.  On Windows Rhino it will
return the Id for the dock bar which host the specified panel or
Guid.Empty if the panel is not currently visible.