Rhino.Geometry.LinearDimension.Create(Rhino.Geometry.AnnotationType,Rhino.DocObjects.DimensionStyle,Rhino.Geometry.Plane,Rhino.Geometry.Vector3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Double)
Initialize Dimension parameters
dimtype: AnnotationType.Rotated or AnnotationType.Aligned
dimStyle: Dimension's DimensionStyle
plane: Dimension's plane
horizontal: Horizontal reference direction
defpoint1: First definition point
defpoint2: Second definition point
dimlinepoint: Point on dimension line
rotationInPlane: For Rotated style
Returns:

Rhino.Geometry.LinearDimension.Get3dPoints(Rhino.Geometry.Point3d@,Rhino.Geometry.Point3d@,Rhino.Geometry.Point3d@,Rhino.Geometry.Point3d@,Rhino.Geometry.Point3d@,Rhino.Geometry.Point3d@)
Get locations of dimension's 3d points
extensionLine1End: First definition point
extensionLine2End: Second definition point
arrowhead1End: First arrowhead point
arrowhead2End: Second Arrowhead point
dimlinepoint: Point on dimension line
textpoint: Text location
Returns: true = success