Rhino.Display.RhinoPageView.Duplicate(System.Boolean)
Copy a page view
duplicatePageGeometry:
Returns:

Rhino.Display.RhinoPageView.PrinterName
Returns the name of the layout's destination printer.

Rhino.Display.RhinoPageView.PaperName
Returns the name of the layout's media, or paper (e.g. Letter, Legal, A1, etc.),
used to determine the page width and page height.