Rhino.FileIO.File3dmObjectTable.AddAngularDimension(Rhino.Geometry.AngularDimension)
Adds a angular dimension object to the 3dm file object table.
dimension: Dimension object to add.
Returns: A unique identifier for the object.

Rhino.FileIO.File3dmObjectTable.AddAngularDimension(Rhino.Geometry.AngularDimension,Rhino.DocObjects.ObjectAttributes)
Adds a angular dimension object to the 3dm file object table.
dimension: Dimension object to add.
attributes: Attributes to apply to dimension.
Returns: A unique identifier for the object.

Rhino.FileIO.File3dmObjectTable.AddTextDot(Rhino.Geometry.TextDot)
Adds a text dot object to the table.
dot: The text dot.
Returns: A unique identifier for the object.

Rhino.FileIO.File3dmObjectTable.AddTextDot(Rhino.Geometry.TextDot,Rhino.DocObjects.ObjectAttributes)
Adds a text dot object to the table.
dot: The text dot.
attributes: Attributes to link with text dot.
Returns: A unique identifier for the object.

Rhino.FileIO.File3dmObjectTable.AddInstanceObject(Rhino.Geometry.InstanceReferenceGeometry)
Adds an instance reference geometry object to the table.
instanceReference: The instance reference geometry object.
Returns: A unique identifier for the object.

Rhino.FileIO.File3dmObjectTable.AddInstanceObject(Rhino.Geometry.InstanceReferenceGeometry,Rhino.DocObjects.ObjectAttributes)
Adds an instance reference geometry object to the table.
instanceReference: The instance reference geometry object.
attributes: The attributes to link with the object.
Returns: A unique identifier for the object.

Rhino.FileIO.File3dmObjectTable.AddInstanceObject(System.Int32,Rhino.Geometry.Transform)
Adds an instance reference geometry object to the table.
instanceDefinitionIndex: The index of the instance definition geometry object.
instanceXform: The transformation.
Returns: A unique identifier for the object.

Rhino.FileIO.File3dmObjectTable.AddInstanceObject(System.Int32,Rhino.Geometry.Transform,Rhino.DocObjects.ObjectAttributes)
Adds an instance reference geometry object to the table.
instanceDefinitionIndex: The index of the instance definition geometry object.
instanceXform: The transformation.
attributes: The object attributes.
Returns: A unique identifier for the object.

Rhino.FileIO.File3dmObjectTable.Count
Returns the total amount of items in the object table, including lights.

Rhino.FileIO.File3dmObjectTable.GetEnumerator
Returns an enumerator that yields all objects in this document.
Like in Rhino, this includes lights. Unlike in Rhino, however, all lights are returned in the end of the list.
Returns: An enumerator that yields all objects in a document.