Rhino.Geometry.ClippingPlaneSurface.ViewportIds
Returns the ids of RhinoViewport objects that are clipped by this clipping plane.
Returns: The ids of RhinoViewport objects.

Rhino.Geometry.ClippingPlaneSurface.AddClipViewportId(System.Guid)
Adds a viewport id to the list of viewports that this clipping plane clips.
viewportId: The id of the RhinoViewport to add.
Returns: true if the viewport was added, false if the viewport is already in the list.

Rhino.Geometry.ClippingPlaneSurface.RemoveClipViewportId(System.Guid)
Removes a viewport id that this being clipped by this clipping plane.
viewportId: The id of the RhinoViewport to remove.
Returns: true if the viewport was removed, false if the viewport was not in the list.