Rhino.Geometry.MeshFace.IsValidEx(Rhino.Geometry.Point3d[]@)
Gets a value indicating whether or not this mesh face
is considered to be valid. Unlike the simple IsValid function,
this function takes actual point locations into account.
points: Array of vertices with which to validate the face.
Returns: true if the face is considered valid, false if not.

Rhino.Geometry.MeshFace.RepairEx(Rhino.Geometry.Point3d[]@)
Attempts to repair this mesh face by taking both face indexes and
actual vertex locations into account.
points: Array of vertices with which to consider when repairing the face.
Returns: true if the face was repaired, false if not.
Remarks: This function assumes the face is invalid and attempts to repair unconditionally.  It is
only worthwhile to call Repair on faces where IsValid returns false.
This function is the analog of UnsafeNativeMethods.ON_MeshFace_Repair done completely here to avoid
copying the point array.