Rhino.DocObjects.ObjectAttributes.AddHideInDetailOverride(System.Guid)
Make this object hidden in a given detail
detailId:
Returns:

Rhino.DocObjects.ObjectAttributes.RemoveHideInDetailOverride(System.Guid)
Remove hidden in detail flag for a specific detail
detailId:
Returns:

Rhino.DocObjects.ObjectAttributes.HasHideInDetailOverrideSet(System.Guid)
Is this object supposed to be hidden in a given detail
detailId:
Returns:

Rhino.DocObjects.ObjectAttributes.GetHideInDetailOverrides
Get list of details that this object is supposed to be hidden in
Returns:

Rhino.DocObjects.ObjectAttributes.Url
Objects may have an URL. There are no restrictions on what value this
URL may have. As an example, if the object came from a commercial part
library, the URL might point to the definition of that part.