Rhino.Geometry.Intersect.IntersectionEvent.ParameterB
Gets the parameter on Curve B where the intersection occured.
If the intersection type is overlap, then this will return the
start of the overlap region.