Rhino.ApplicationSettings.ViewSettingsState.ZoomExtentsParallelViewBorder
Border amount to apply to parallel viewport during zoom extents

Rhino.ApplicationSettings.ViewSettingsState.ZoomExtentsPerspectiveViewBorder
Border amount to apply to perspective viewport during zoom extents