Rhino.Geometry.RTree.CreateFromPointArray(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d})
Constructs a new tree with an element for each pointcloud point.
points: Points.
Returns: A new tree, or null on error.

Rhino.Geometry.RTree.PointCloudClosestPoints(Rhino.Geometry.PointCloud,System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Double)
Finds the point in a list of 3D points that is closest to a test point.
pointcloud: A point cloud to be searched.
needlePts: Points to search for.
limitDistance: The maximum allowed distance.
Returns: An enumerable of arrays of indices; each array contains the indices for each of the needlePts.

Rhino.Geometry.RTree.Point3dClosestPoints(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Double)
Finds the point in a list of 3D points that is closest to a test point.
hayPoints: A series of points.
needlePts: Points to search for.
limitDistance: The maximum allowed distance.
Returns: An enumerable of arrays of indices; each array contains the indices for each of the needlePts.

Rhino.Geometry.RTree.PointCloudKNeighbors(Rhino.Geometry.PointCloud,System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Int32)
Finds a certain amout of points in a list of 3D points that are the k-closest to a test point.
pointcloud: A point cloud to be searched.
needlePts: Points to search for.
amount: The required amount of closest neighbors to find.
Returns: An enumerable of arrays of indices; each array contains the indices for each of the needlePts.
Rhino.Collections.RhinoList.PointCloudKNeighbors(Rhino.Geometry.PointCloud,System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Int32)

Rhino.Geometry.RTree.Point3dKNeighbors(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Int32)
Finds a certain amout of points in a list of 3D points that are the k-closest to a test point.
hayPoints: A series of points.
needlePts: Points to search for.
amount: The required amount of closest neighbors to find.
Returns: An enumerable of arrays of indices; each array contains the indices for each of the needlePts.
Rhino.Collections.RhinoList.Point3dKNeighbors(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Int32)