Rhino.FileIO.File3dmGroupTable.ComponentType
Returns Rhino.DocObjects.ModelComponentType.Group.

Rhino.FileIO.File3dmGroupTable.FindName(System.String)
Finds a Group given its name.
name: The name of the Group to be searched.
Returns: A Group, or null on error.

Rhino.FileIO.File3dmGroupTable.FindNameHash(Rhino.FileIO.NameHash)
Finds a Group given its name hash.
nameHash: The name hash of the Group to be searched.
Returns: A Group, or null on error.

Rhino.FileIO.File3dmGroupTable.FindIndex(System.Int32)
Retrieves a Group object based on Index. This seach type of search is discouraged.
We are moving towards using only IDs for all tables.
index: The index to search for.
Returns: A Group object, or null if none was found.