Rhino.Collections.ArchivableDictionary.TryGetPlane(System.String,Rhino.Geometry.Plane@)
Get value as Plane, will only succeed if value was created using Set(string key, Plane value)
key: The key.
value: The value.
Returns: The value as Plane.

Rhino.Collections.ArchivableDictionary.GetPlane(System.String)
Get value as Plane, will return defaultValue unless value was created using Set(string key, Plane value)
key: The key.
Returns: The value as Plane.

Rhino.Collections.ArchivableDictionary.GetPlane(System.String,Rhino.Geometry.Plane)
Get value as Plane, will return defaultValue unless value was created using Set(string key, Plane value)
key: The key.
defaultValue: The default value.
Returns: The value as Plane.