Rhino.Runtime.FileSettingsService.SupportsPlist
If true then WriteToPlist and ReadFromPlist are alled to serialize settings
otherwise; WriteSettings and ReadSettings are called using XML in a memroy
stream.
true if supports plist; otherwise, false.

Rhino.Runtime.FileSettingsService.WriteToPlist(System.Boolean,Rhino.PersistentSettings,System.Collections.Generic.Dictionary{System.String,Rhino.PersistentSettings},System.Action{System.Boolean,System.Boolean})
Writes the settings.
Returns: true, if settings was writed, false otherwise.
isShuttingDown: If set to true is shutting down.
settings: Settings.
commandSettings: Command settings.
writing: Writing.

Rhino.Runtime.FileSettingsService.TryGetPlistValue(Rhino.PersistentSettings,System.String,System.Func{System.String,Rhino.SettingValue})
Check to see if a setting value exist in a key and if it does create a new
SettingValue and iniialize its ValueString using the plist value.
persistentSettings: Persistent settings containing the key.
key: Setting value key name.
newSettingValue:
Invoked to create new SettingValue which will get initialized with the current
PLIST value.

Rhino.Runtime.FileSettingsService.ReadFromPlist(System.Guid,Rhino.PersistentSettings@,System.Func{System.String,Rhino.PersistentSettings})
Read settings directly from some system provided archive.  This is used
on Mac to read settings from the com.mcneel.rhinoceros.plist
Returns: true, if read settings was directed, false otherwise.
plugInId: Plug in identifier.
settings: Settings.
commandSettings: Command settings.

Rhino.Runtime.FileSettingsService.OnAddSettingValue(Rhino.SettingValue)
Called when a new setting value is added to the runtime
dictionary, Mac Rhino should check the PLIST for the
key and initialze it with the current key value
settingValue: Setting value.