Rhino.Runtime.HostUtils.GetCurrentProcessInfo(System.String@,System.Version@)
Returns information about the current process. If Rhino is the top level process,
processName is "Rhino". Otherwise, processName is the name, without extension, of the main
module that is executing. For example, "compute.backend" or "Revit".
processVersion is the System.Version of the running process. It is the FileVersion
of the executable.

Rhino.Runtime.HostUtils.OperatingSystemEdition
Returns Operating System Edition: "Professional" | "ServerDatacenter" | ... | "Unknown"

Rhino.Runtime.HostUtils.OperatingSystemInstallationType
Returns Operating System Installation Type: "Client" | "Server" | "Unknown"

Rhino.Runtime.HostUtils.OperatingSystemProductName
Returns Operating System Edition: "Professional" | "ServerDatacenter" | ... | "Unknown"

Rhino.Runtime.HostUtils.OperatingSystemVersion
Returns Operating System Version "6.1" | "6.3" | ... | "Unknown"

Rhino.Runtime.HostUtils.OperatingSystemBuildNumber
Returns Operating System Build Number "11763" | "7601" | ... | "Unknown"

Rhino.Runtime.HostUtils.ClearFpuExceptionStatus
Clear FPU exception and busy flags (Intel assembly fnclex)

Rhino.Runtime.HostUtils.RegisterNamedCallback(System.String,System.EventHandler{Rhino.Runtime.NamedParametersEventArgs})
Register a named callback from C++ -> .NET
name:
callback:

Rhino.Runtime.HostUtils.CurrentOSLanguage
Get the current operating system language.
Returns: A Windows LCID (on Windows and macOS).  On Windows, this will be
LCID value regardless of those languages that Rhino supports.  On macOS, this only
returns LCID values for languages that Rhino does support.

Rhino.Runtime.HostUtils.IsRhinoFileExtension(System.String)
Check to see if the file extension is a valid Rhino file extension.
fileExtension:
Returns:
Returns true if fileExtension is ".3dm", "3dm", ".3dx" or "3dx",
ignoring case.

Rhino.Runtime.HostUtils.FileNameEndsWithRhinoExtension(System.String)
Strip file extension from file name and check to see if it is a valid
Rhino file extension.
fileName:
File name to check.
Returns:
Returns true if the file name has an extension like 3dm.

Rhino.Runtime.HostUtils.IsRhinoBackupFileExtension(System.String)
Check to see if the file extension is a valid Rhino file extension.
fileExtension:
Returns:
Return true if fileExtension is ".3dmbak", "3dmbak", ".3dm.bak", "3dm.bak",
".3dx.bak" or "3dx.bak", ignoring case.

Rhino.Runtime.HostUtils.FileNameEndsWithRhinoBackupExtension(System.String)
Strip file extension from file name and check to see if it is a valid
Rhino backup file extension.
fileName:
File name to check.
Returns:
Returns true if the file name has an extension like 3dmbak.

Rhino.Runtime.HostUtils.SendLogMessageToCloudCallbackProc(Rhino.Runtime.HostUtils.LogMessageType,System.IntPtr,System.IntPtr,System.IntPtr)
Informs RhinoCommon of an message that has been handled but that the developer wants to screen.
pwStringClass: The top level message type.
pwStringDesc: Finer grained description of the message.
pwStringMessage: The message.
msg_type: The messag type

Rhino.Runtime.HostUtils.OnSendLogMessageToCloud
Is raised when an exception is reported with one of the  method.