Rhino.Runtime.Analytics.UserId
Returns a GUID that allows events to be aggregated by user. There is no way to determine who the
end user is based on this GUID, unless the user tells you their ID.  On Windows, this uses the
registry to store the ID.  On Mac, the Hardware UUID is used as the ID.