Rhino.Geometry.AreaMassProperties.Compute(Rhino.Geometry.Mesh,System.Boolean,System.Boolean,System.Boolean,System.Boolean)
Compute the AreaMassProperties for a single Mesh.
mesh: Mesh to measure.
area: true to calculate area.
firstMoments: true to calculate area first moments, area, and area centroid.
secondMoments: true to calculate area second moments.
productMoments: true to calculate area product moments.
Returns: The AreaMassProperties for the given Mesh or null on failure.
Throws System.ArgumentNullException: When mesh is null.

Rhino.Geometry.AreaMassProperties.Compute(Rhino.Geometry.Brep,System.Boolean,System.Boolean,System.Boolean,System.Boolean)
Compute the AreaMassProperties for a single Brep.
brep: Brep to measure.
area: true to calculate area.
firstMoments: true to calculate area first moments, area, and area centroid.
secondMoments: true to calculate area second moments.
productMoments: true to calculate area product moments.
Returns: The AreaMassProperties for the given Brep or null on failure.
Throws System.ArgumentNullException: When brep is null.

Rhino.Geometry.AreaMassProperties.Compute(Rhino.Geometry.Surface,System.Boolean,System.Boolean,System.Boolean,System.Boolean)
Compute the AreaMassProperties for a single Surface.
surface: Surface to measure.
area: true to calculate area.
firstMoments: true to calculate area first moments, area, and area centroid.
secondMoments: true to calculate area second moments.
productMoments: true to calculate area product moments.
Returns: The AreaMassProperties for the given Surface or null on failure.
Throws System.ArgumentNullException: When surface is null.

Rhino.Geometry.AreaMassProperties.Compute(System.Collections.Generic.IEnumerable{Rhino.Geometry.GeometryBase},System.Boolean,System.Boolean,System.Boolean,System.Boolean)
Computes the AreaMassProperties for a collection of geometric objects.
At present only Breps, Surfaces, Meshes and Planar Closed Curves are supported.
geometry: Objects to include in the area computation.
area: true to calculate area.
firstMoments: true to calculate area first moments, area, and area centroid.
secondMoments: true to calculate area second moments.
productMoments: true to calculate area product moments.
Returns: The AreaMassProperties for the entire collection or null on failure.

Rhino.Geometry.AreaMassProperties.WorldCoordinatesPrincipalMoments(System.Double@,Rhino.Geometry.Vector3d@,System.Double@,Rhino.Geometry.Vector3d@,System.Double@,Rhino.Geometry.Vector3d@)
Calculates the principal moments and principal axes with repect to world coordinates.
These are simply the eigenvalues and eigenvectors of the world coordinate inertia matrix.
x: Principal moment.
xaxis: Principal axis for x.
y: Principal moment.
yaxis: Principal axis for y.
z: Principal moment.
zaxis: Principal axis for z.
Returns: true if successful.

Rhino.Geometry.AreaMassProperties.CentroidCoordinatesPrincipalMoments(System.Double@,Rhino.Geometry.Vector3d@,System.Double@,Rhino.Geometry.Vector3d@,System.Double@,Rhino.Geometry.Vector3d@)
Calculates the principal moments and principal axes with repect to centroid coordinates.
These are simply the eigenvalues and eigenvectors of the centroid coordinate inertia matrix.
x: Principal moment.
xaxis: Principal axis for x.
y: Principal moment.
yaxis: Principal axis for y.
z: Principal moment.
zaxis: Principal axis for z.
Returns: true if successful.