Rhino.Geometry.Surface.Smooth(System.Double,System.Boolean,System.Boolean,System.Boolean,System.Boolean,Rhino.Geometry.SmoothingCoordinateSystem)
Smooths a surface by averaging the positions of control points in a specified region.
smoothFactor: The smoothing factor, which controls how much control points move towards the average of the neighboring control points.
bXSmooth: When true control points move in X axis direction.
bYSmooth: When true control points move in Y axis direction.
bZSmooth: When true control points move in Z axis direction.
bFixBoundaries: When true the surface edges don't move.
coordinateSystem: The coordinates to determine the direction of the smoothing.
Returns: The smoothed surface if successful, null otherwise.

Rhino.Geometry.Surface.Smooth(System.Double,System.Boolean,System.Boolean,System.Boolean,System.Boolean,Rhino.Geometry.SmoothingCoordinateSystem,Rhino.Geometry.Plane)
Smooths a surface by averaging the positions of control points in a specified region.
smoothFactor: The smoothing factor, which controls how much control points move towards the average of the neighboring control points.
bXSmooth: When true control points move in X axis direction.
bYSmooth: When true control points move in Y axis direction.
bZSmooth: When true control points move in Z axis direction.
bFixBoundaries: When true the surface edges don't move.
coordinateSystem: The coordinates to determine the direction of the smoothing.
plane: If SmoothingCoordinateSystem.CPlane specified, then the construction plane.
Returns: The smoothed surface if successful, null otherwise.

Rhino.Geometry.Surface.VariableOffset(System.Double,System.Double,System.Double,System.Double,System.Double)
Copies a surface so that all locations at the corners of the copied surface are specified distances from the original surface.
uMinvMin: Offset distance at Domain(0).Min, Domain(1).Min.
uMinvMax: Offset distance at Domain(0).Min, Domain(1).Max.
uMaxvMin: Offset distance at Domain(0).Max, Domain(1).Min.
uMaxvMax: Offset distance at Domain(0).Max, Domain(1).Max.
tolerance: The offset tolerance.
Returns: The offset surface if successful, null otherwise.

Rhino.Geometry.Surface.VariableOffset(System.Double,System.Double,System.Double,System.Double,System.Collections.Generic.IEnumerable{Rhino.Geometry.Point2d},System.Collections.Generic.IEnumerable{System.Double},System.Double)
Copies a surface so that all locations at the corners, and from specified interior locations, of the copied surface are specified distances from the original surface.
uMinvMin: Offset distance at Domain(0).Min, Domain(1).Min.
uMinvMax: Offset distance at Domain(0).Min, Domain(1).Max.
uMaxvMin: Offset distance at Domain(0).Max, Domain(1).Min.
uMaxvMax: Offset distance at Domain(0).Max, Domain(1).Max.
interiorParameters: An array of interior uv parameters to offset from.
interiorDistances: >An array of offset distances at the interior uv parameters.
tolerance: The offset tolerance.
Returns: The offset surface if successful, null otherwise.

Rhino.Geometry.Surface.RebuildOneDirection(System.Int32,System.Int32,Rhino.Geometry.LoftType,System.Double)
Rebuilds an existing surface with a new surface to a given point count in either the u or v directions independently.
direction: The direction (0 = U, 1 = V).
pointCount: The number of points in the output surface in the "direction" direction.
loftType: The loft type
refitTolerance: The refit tolerance. When in doubt, use the document's model absolute tolerance.
Returns: new rebuilt surface on success. null on failure.

Rhino.Geometry.Surface.LocalClosestPoint(Rhino.Geometry.Point3d,System.Double,System.Double,System.Double@,System.Double@)
Find parameters of the point on a surface that is locally closest to
the testPoint. The search for a local close point starts at seed parameters.
testPoint: A point to test against.
seedU: The seed parameter in the U direction.
seedV: The seed parameter in the V direction.
u: U parameter of the surface that is closest to testPoint.
v: V parameter of the surface that is closest to testPoint.
Returns: true if the search is successful, false if the search fails.