Rhino.UI.ObjectPropertiesPageEventArgs.EventRuntimeSerialNumber
Gets the runtime serial number.
The runtime serial number.

Rhino.UI.ObjectPropertiesPageEventArgs.IncludesObjectsType``1(System.Boolean)
Return true if any of the selected objects match the given type
allMustMatch:
If true then every selected object must match the object type
otherwise; only a single object has to be of the specified type
Returns:

Rhino.UI.ObjectPropertiesPageEventArgs.IncludesObjectsType(Rhino.DocObjects.ObjectType,System.Boolean)
objectTypes:
allMustMatch:
If true then every selected object must match the object type
otherwise; only a single object has to be of the specified type
Returns: