Rhino.UI.DrawingUtilities.BitmapFromIconResource(System.String,System.Reflection.Assembly)
Load a Icon from an embedded resource and convert it to a bitmap of the
specified size.  Will look for a icon image that is greater than or
equal to the requested size, if all images are less than the requested
size the largest image will be used.
resourceName:
assembly:
The assembly containing the manifest resource, will use the calling
assembly if null.
Returns: