Rhino.Geometry.Collections.MeshFaceList.Count
Gets or sets the number of mesh faces. When getting this can includes invalid faces.

Rhino.Geometry.Collections.MeshFaceList.QuadCount
Gets the number of faces that are valid quads (4 corners).

Rhino.Geometry.Collections.MeshFaceList.TriangleCount
Gets the number of faces that are valid triangles (3 corners).

Rhino.Geometry.Collections.MeshFaceList.ToIntArray(System.Boolean)
Copies all of the face indices to a linear array of indices per face.
Note that this includes indices from invalid faces too.
Returns: The int array. This method never returns null.
asTriangles: If set to true as triangles.

Rhino.Geometry.Collections.MeshFaceList.DeleteFaces(System.Collections.Generic.IEnumerable{System.Int32},System.Boolean)
Removes a collection of faces from the mesh without affecting the remaining geometry.
faceIndexes: An array containing all the face indices to be removed.
compact: No longer used.
Returns: The number of faces deleted on success.

Rhino.Geometry.Collections.MeshFaceList.RemoveAt(System.Int32,System.Boolean)
Removes a face from the mesh.
index: The index of the face that will be removed.
compact: No longer used.
Throws System.ArgumentOutOfRangeException: If index is < 0 or >= Count.