Rhino.Geometry.Point3d.TryParse(System.String,Rhino.Geometry.Point3d@)
Converts the string representation of a point to the equivalent Point3d structure.
input: The point to convert.
result: The structure that will contain the parsed value.
Returns: true if successful, false otherwise.