Rhino.Geometry.VolumeMassProperties.Compute(Rhino.Geometry.Mesh,System.Boolean,System.Boolean,System.Boolean,System.Boolean)
Compute the VolumeMassProperties for a single Mesh.
mesh: Mesh to measure.
volume: true to calculate volume.
firstMoments: true to calculate volume first moments, volume, and volume centroid.
secondMoments: true to calculate volume second moments.
productMoments: true to calculate volume product moments.
Returns: The VolumeMassProperties for the given Mesh or null on failure.
Throws System.ArgumentNullException: When Mesh is null.

Rhino.Geometry.VolumeMassProperties.Compute(Rhino.Geometry.Brep,System.Boolean,System.Boolean,System.Boolean,System.Boolean)
Compute the VolumeMassProperties for a single Brep.
brep: Brep to measure.
volume: true to calculate volume.
firstMoments: true to calculate volume first moments, volume, and volume centroid.
secondMoments: true to calculate volume second moments.
productMoments: true to calculate volume product moments.
Returns: The VolumeMassProperties for the given Brep or null on failure.
Throws System.ArgumentNullException: When brep is null.

Rhino.Geometry.VolumeMassProperties.Compute(Rhino.Geometry.Surface,System.Boolean,System.Boolean,System.Boolean,System.Boolean)
Compute the VolumeMassProperties for a single Surface.
surface: Surface to measure.
volume: true to calculate volume.
firstMoments: true to calculate volume first moments, volume, and volume centroid.
secondMoments: true to calculate volume second moments.
productMoments: true to calculate volume product moments.
Returns: The VolumeMassProperties for the given Surface or null on failure.
Throws System.ArgumentNullException: When surface is null.

Rhino.Geometry.VolumeMassProperties.Compute(System.Collections.Generic.IEnumerable{Rhino.Geometry.GeometryBase})
Computes the VolumeMassProperties for a collection of geometric objects.
At present only Breps, Surfaces, and Meshes are supported.
geometry: Objects to include in the area computation.
Returns: The VolumeMassProperties for the entire collection or null on failure.

Rhino.Geometry.VolumeMassProperties.Compute(System.Collections.Generic.IEnumerable{Rhino.Geometry.GeometryBase},System.Boolean,System.Boolean,System.Boolean,System.Boolean)
Computes the VolumeMassProperties for a collection of geometric objects.
At present only Breps, Surfaces, Meshes and Planar Closed Curves are supported.
geometry: Objects to include in the area computation.
volume: true to calculate volume.
firstMoments: true to calculate volume first moments, volume, and volume centroid.
secondMoments: true to calculate volume second moments.
productMoments: true to calculate volume product moments.
Returns: The VolumeMassProperties for the entire collection or null on failure.