Rhino.DocObjects.ViewportInfo.CalculateCameraRotationAngle(Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d)
Calculates the camera rotation angle.
direction: The camera direction.
up: The camera up direction.
Returns: The camera rotation angle in radians.

Rhino.DocObjects.ViewportInfo.CalculateCameraUpDirection(Rhino.Geometry.Point3d,Rhino.Geometry.Vector3d,System.Double)
Calculates the camera up direction.
location: The camera location.
direction: The camera direction.
angle: The camera rotation angle in radians.
Returns: The camera up direction.