Rhino.Geometry.GeometryBase.GeometryEquals(Rhino.Geometry.GeometryBase,Rhino.Geometry.GeometryBase)
Determines if two geometries equal one another, in pure geometrical shape.
This version only compares the geometry itself and does not include any user
data comparisons.
This is a comparison by value: for two identical items it will be true, no matter
where in memory they may be stored.
first: The first geometry
second: The second geometry
Returns: The indication of equality