Rhino.Geometry.Collections.BrepFaceList.ShrinkFaces
Shrinks all the underlying surfaces in this Brep.
Sometimes the surfaces extend far beyond the trimming boundaries of the Brep Face.
This function will remove those portions of the surfaces that are not used.
Returns: true on success, false on failure.