Rhino.Render.RenderContent.Create(System.Guid,Rhino.Render.RenderContent.ShowContentChooserFlags,Rhino.RhinoDoc)
Constructs a new content of the specified type and add it to the persistent content list.
This function cannot be used to create temporary content that you delete after use.
Content created by this function is owned by RDK and appears in the content editor.
To create a temporary content which is owned by you, call RenderContentType.NewContentFromType().
type: Is the type of the content to add.
flags: Options for the tab.
doc: The current Rhino document.
Returns: A new persistent render content.

Rhino.Render.RenderContent.Create(System.Type,Rhino.Render.RenderContent.ShowContentChooserFlags,Rhino.RhinoDoc)
Constructs a new content of the specified type and add it to the persistent content list.
This function cannot be used to create temporary content that you delete after use.
Content created by this function is owned by RDK and appears in the content editor.
To create a temporary content which is owned by you, call RenderContentType.NewContentFromType().
type: Is the type of the content to add.
flags: Options for the tab.
doc: The current Rhino document.
Returns: A new persistent render content.

Rhino.Render.RenderContent.Create(System.Guid,Rhino.Render.RenderContent,System.String,Rhino.Render.RenderContent.ShowContentChooserFlags,Rhino.RhinoDoc)
Constructs a new content of the specified type and add it to the persistent content list.
This function cannot be used to create temporary content that you delete after use.
Content created by this function is owned by RDK and appears in the content editor.
To create a temporary content which is owned by you, call RenderContentType.NewContentFromType().
type: is the type of the content to add.
parent: Parent is the parent content. If not NULL, this must be an RDK-owned content that is
in the persistent content list (either top-level or child). The new content then becomes its child.
If NULL, the new content is added to the top-level content list instead.
childSlotName: ChildSlotName is the unique child identifier to use for the new content when creating it as a child of pParent (i.e., when pParent is not NULL)
flags: Options for the tab.
doc: The current Rhino document.
Returns: A new persistent render content.

Rhino.Render.RenderContent.Create(System.Type,Rhino.Render.RenderContent,System.String,Rhino.Render.RenderContent.ShowContentChooserFlags,Rhino.RhinoDoc)
Constructs a new content of the specified type and add it to the persistent content list.
This function cannot be used to create temporary content that you delete after use.
Content created by this function is owned by RDK and appears in the content editor.
To create a temporary content which is owned by you, call RenderContentType.NewContentFromType().
type: is the type of the content to add.
parent: Parent is the parent content. If not NULL, this must be an RDK-owned content that is
in the persistent content list (either top-level or child). The new content then becomes its child.
If NULL, the new content is added to the top-level content list instead.
childSlotName: ChildSlotName is the unique child identifier to use for the new content when creating it as a child of pParent (i.e., when pParent is not NULL)
flags: Options for the tab.
doc: The current Rhino document.
Returns: A new persistent render content.

Rhino.Render.RenderContent.Tags
Tags for this content.

Rhino.Render.RenderContent.Category
Category for this content.

Rhino.Render.RenderContent.ForDisplay
**** This method is for proxies and will be marked obsolete in V7 ****
The only place a single proxy can be displayed is in the
New Content Control main thumbnail. All other attempts to
use a single proxy in a UI require it to be replaced with
the corresponding multi proxy. Single proxies override this
to find the corresponding multi proxy.
Returns: The cotnent.

Rhino.Render.RenderContent.IsReference
Query whether or not the content or any of its ancestors is a reference content.
Returns: true if the content is a reference, else false

Rhino.Render.RenderContent.UseCount
UseCount returns how many times the content is used

Rhino.Render.RenderContent.RenderHashExclude(Rhino.Render.CrcRenderHashFlags,System.String)
As RenderHash, but ignore parameter names given.
flags: Flags to ignore
excludeParameterNames: semicolon-delimited string
Returns: Render hash

Rhino.Render.RenderContent.IsHiddenByAutoDelete
Contents can be created as 'auto-delete' by certain commands such as 'PictureFrame'.
These contents are automatically hidden from the user when the associated Rhino object
is deleted. They are later deleted when the document is saved.

Rhino.Render.RenderContent.Edit
Call this method to open the content in the a modal version of the editor.
The content must be in the document or the call will fail.
Returns:
Returns the edited content on succees or null on error.