Rhino.DocObjects.Font.FaceName
Returns Facename

Rhino.DocObjects.Font.EnglishFaceName
Returns English Facename

Rhino.DocObjects.Font.LogfontName
Returns Windows Logfont Facename

Rhino.DocObjects.Font.FamilyPlusFaceName
Returns concatinated Family and Face names

Rhino.DocObjects.Font.PostScriptName
Returns the Font PostScriptName - "Apple font name"

Rhino.DocObjects.Font.RichTextFontName
Returns the Font RichTextFontName used in RTF strings:
{\\fonttbl...{\\fN RichTextFontName;}...}

Rhino.DocObjects.Font.Description
Returns a long description that includes family, face, weight, stretch and style information.
Generally not useful for finding matching fonts.