Rhino.PlugIns.LicenseLease.ProductId
The ID of the product that this lease is issued to

Rhino.PlugIns.LicenseLease.GroupName
Name of Rhino Accounts group that this lease came from

Rhino.PlugIns.LicenseLease.GroupId
ID of Rhino Accounts group that this lease came from

Rhino.PlugIns.LicenseLease.UserName
Name of Rhino Accounts user that was logged in when this lease was obtained

Rhino.PlugIns.LicenseLease.UserId
ID of Rhino Accounts user that was logged in when this lease was obtained

Rhino.PlugIns.LicenseLease.ProductTitle
Title of product that this lease is issued to. For example, "Rhino 6"

Rhino.PlugIns.LicenseLease.ProductVersion
Version of product that this lease is issued to. For example, "6.0"

Rhino.PlugIns.LicenseLease.ProductEdition
Edition of product that this lease is issued to. For example, "Commercial" or "Beta"

Rhino.PlugIns.LicenseLease.LeaseId
The ID of this lease.

Rhino.PlugIns.LicenseLease.IssuedAt
The date this lease was issued

Rhino.PlugIns.LicenseLease.Expiration
The date when this lease will expire