Rhino.RhinoApp.GetExecutableDirectory
directory

Rhino.RhinoApp.IsRunningHeadless
Is Rhino currently being executed in headless mode

Rhino.RhinoApp.IsSkinned
Is Rhino currently using custom, user-interface Skin.

Rhino.RhinoApp.IsInternetAccessAllowed
Returns true when Rhino is allowed to access the internet, false otherwise

Rhino.RhinoApp.UpdatesAndStatisticsStatus
Returns true when Rhino is allowed to access the internet, false otherwise

Rhino.RhinoApp.ChangeLicenseKey(System.Guid)
Display UI asking the user to enter a license for the product specified by licenseId.
pluginId: Guid identifying the plugin that is requesting a change of license key
Returns: true on success, false otherwise