Rhino.Geometry.Polyline.MergeColinearSegments(System.Double,System.Boolean)
Merge co-linear consecutive segments in a polyline.
This method will automatically remove any zero-length segments as well.
angleTolerance: The angle tolerance between adjacent segments for co-linearlity test.
includeSeam: If true, the seam point of a closed polyline will be moved forwards if it is colinear too.
Returns: Number of segments removed from the entire polyline.

Rhino.Geometry.Polyline.CreateInscribedPolygon(Rhino.Geometry.Circle,System.Int32)
Create a regular polygon inscribed in a circle. The vertices of the polygon will be on the circle.
circle: The circle.
sideCount: The number of sides
Returns: A closed polyline if successful, null otherwise.

Rhino.Geometry.Polyline.CreateCircumscribedPolygon(Rhino.Geometry.Circle,System.Int32)
Create a regular polygon circumscribe about a circle. The midpoints of the polygon's edges will be tanget to the circle.
circle: The circle.
sideCount: The number of sides
Returns: A closed polyline if successful, null otherwise.

Rhino.Geometry.Polyline.CreateStarPolygon(Rhino.Geometry.Circle,System.Double,System.Int32)
Create a regular star polygon. The star begins at circle.PointAt(0) and the vertices
alternate between being on circle and begin on a concentric circle of other_radius.
circle: The circle.
radius: The radius of other circle.
cornerCount: The number of corners on the circle. There will be 2*cornerCount sides and 2*cornerCount vertices.
Returns: A closed polyline if successful, null otherwise.