Rhino.Geometry.Leader.Create(System.String,Rhino.Geometry.Plane,Rhino.DocObjects.DimensionStyle,Rhino.Geometry.Point3d[])
Creates a Leader geometry object
text:
plane:
dimstyle:
points:
Returns:

Rhino.Geometry.Leader.CreateWithRichText(System.String,Rhino.Geometry.Plane,Rhino.DocObjects.DimensionStyle,Rhino.Geometry.Point3d[])
Creates a Leader geometry object
richText:
plane:
dimstyle:
points:
Returns: