Rhino.ApplicationSettings.OpenGLSettingsState
Represents a sapshot of Rhino.ApplicationSettings.OpenGLSettings

Rhino.ApplicationSettings.OpenGLSettingsState.AntialiasLevel
AA level used in OpenGL viewports