Rhino.FileIO.FileObjWriteOptions.ActualFilePathOnMac
Remarks:
The path passed to FileExportPlugIn::WriteFile on the Mac
is a temporary path.  The calling function takes care of moving
the temp (.obj) file to it's appropriate location.  We can't use
that to write that path to construct the .mat file because the calling
function doesn't know anything about it.  ActualFilePathOnMac is the path
of the obj file's ultimate destination.  It's only meaningful on the
Mac platform.

Rhino.FileIO.FileObjWriteOptions.MergeNestedGroupingNames
Setting to merge nested layer or group names into a single OBJ group name
Remarks:
Setting this to true will take a layer setup like this in Rhino
Grandparent
Parent
Child
and make a group name of Grandparent__Parent__Child in obj.
If false it will be 3 separate group names in obj and will look like this
in the file.
g Grandparent Parent Child