Rhino.Runtime.Notifications.IAssemblyRestrictedObject.Editable
Determines whether an assembly can modify the instance.
Returns: true if the instance can be edited by the assembly, otherwise returns false.