Rhino.Geometry.AnnotationBase.FontIndex
Obsolete; use Font property instead

Rhino.Geometry.AnnotationBase.PlainTextToRtf(System.String)
str:
Returns:

Rhino.Geometry.AnnotationBase.FirstCharProperties(System.String,System.Boolean@,System.Boolean@,System.Boolean@,System.String@)
rtf_str:
bold:
italic:
underline:
facename:
Returns:
[Obsolete("Use AnnotationBase.FirstCharFont instead")]

Rhino.Geometry.AnnotationBase.FirstCharFont
Returns the font used by the first run of text in an annotation
Returns:

Rhino.Geometry.AnnotationBase.GetBoundingBox(Rhino.Geometry.Transform)
Aligned Boundingbox solver. Gets the world axis aligned boundingbox for the transformed geometry.
xform: Transformation to apply to bbox after calculation.
The geometry is not modified.
Returns: The boundingbox of the transformed geometry in world coordinates
or BoundingBox.Empty if not bounding box could be found.