Rhino.DocObjects.ModelComponent.IsValidComponentName(System.String)
Tests for a valid model component name.
name: The string to validate.
Returns: true if the string is a valid model component name, false otherwise.

Rhino.DocObjects.ModelComponent.DeletedName
Gets the name of a component that is deleted.

Rhino.DocObjects.ModelComponent.ModelSerialNumber
A value identifing the model that manages this component.
Remarks:
If the component is being managed by a model, this value identifies the model.
In Rhino, this value is the document runtime serial number.
Typically this value is set and locked by the code that adds a component to a model.
This value is not saved in .3dm archives.

Rhino.DocObjects.ModelComponent.ReferenceModelSerialNumber
When a component is in a model for reference, this value identifies the reference model.
Remarks:
Reference components are not saved in .3dm archives.
Typically this value is set and locked by the code that adds a component to a model.
This value is not saved in .3dm archives.

Rhino.DocObjects.ModelComponent.InstanceDefinitionModelSerialNumber
When a component is in a model as part of the information required for a linked instance definition,
this value identifies the the linked instance definition reference model.
Remarks:
Reference components are not saved in .3dm archives.
Typically this value is set and locked by the code that adds a component to a model.
This value is not saved in .3dm archives.

Rhino.DocObjects.ModelComponent.ModelComponentTypeIgnoresCase(Rhino.DocObjects.ModelComponentType)
Informs the developer if a particular model component type will require case-ignoring searching within a document.
This is currently true with groups; false otherwise.
type: True if the component ignores case.

Rhino.DocObjects.ModelComponent.ModelComponentTypeIncludesParent(Rhino.DocObjects.ModelComponentType)
Informs the developer if a particular model component type will include the hash of the parent.
type: True if the component includes parent hash.