Rhino.Geometry.Centermark.Create(Rhino.DocObjects.DimensionStyle,Rhino.Geometry.Plane,Rhino.Geometry.Point3d,System.Double)
Create a new centermark
dimStyle: Dimension's AnnotationStyle
plane: Dimension's plane
centerpoint: Dimension's center point
radius: Centermark;s radius
Returns: