Rhino.Geometry.BrepEdge.ConcavityAt(System.Double,System.Double)
Determine the concavity of this edge at a specific parameter.
t: Edge curve parameter.
tolerance: Angle tolerance for tangent faces.
Returns: Concavity measure at parameter.