Rhino.ApplicationSettings.OpenGLSettings.GetDefaultState
Gets the OpenGL factory settings.
Returns: A new OpenGL state with factory settings.

Rhino.ApplicationSettings.OpenGLSettings.GetCurrentState
Gets the current settings.
Returns: A new OpenGL state with current settings.

Rhino.ApplicationSettings.OpenGLSettings.RestoreDefaults
Updates from the default setting state.

Rhino.ApplicationSettings.OpenGLSettings.UpdateFromState(Rhino.ApplicationSettings.OpenGLSettingsState)
Updates from a particular setting state.
state: The new state that will be set.

Rhino.ApplicationSettings.OpenGLSettings.AntialiasLevel
Gets or sets the antialias level used by OpenGL viewports