Rhino.Render.MetaDataProxy.CppPointer
MetaDataProxy c++ pointer

Rhino.Render.MetaDataProxy.#ctor
Constructor for MetaDataProxy

Rhino.Render.MetaDataProxy.Dispose
Dispose for MetaDataProxy

Rhino.Render.MetaDataProxy.SetContentInstanceId(System.Guid)
Set Content instance id for meta data