Rhino.FileIO.File3dm.AllGroups
Grpups in this file.

Rhino.FileIO.File3dm.Views
Views that represent the RhinoViews which are displayed when Rhino loads this file.

Rhino.FileIO.File3dm.AllViews
Views that represent the RhinoViews which are displayed when Rhino loads this file.

Rhino.FileIO.File3dm.NamedViews
Named views in this file.

Rhino.FileIO.File3dm.AllNamedViews
Named views in this file.

Rhino.FileIO.File3dm.NamedConstructionPlanes
Named construction planes in this file.

Rhino.FileIO.File3dm.AllNamedConstructionPlanes
Named construction planes in this file.