Rhino.Geometry.Vector2d.SquareLength
Returns the square of the length of the vector.

Rhino.Geometry.Vector2d.Rotate(System.Double)
Rotates this vector.
angleRadians: Angle of rotation (in radians).
Returns: true on success, false on failure.