Rhino.UI.IStackedDialogPageService.GetImageHandle(System.Drawing.Icon,System.Boolean)
Convert image to platform specific unmanaged pointer
icon:
canBeNull:
Returns:

Rhino.UI.IStackedDialogPageService.GetNativePageWindow(System.Object,System.Object@)
Get the unmanaged pointer associated with the pages content control
nativeWindowObject:
host:
Returns:

Rhino.UI.IStackedDialogPageService.GetNativePageWindow(System.Object,System.Object@,System.Object@)
Get the unmanaged pointer associated with the pages content control
pageObject:
nativeWindowObject:
host:
Returns:

Rhino.UI.IStackedDialogPageService.TryGetControlMinimumSize(System.Object,System.Drawing.SizeF@)
Get the minimum size associated with a control object
Returns:
Returns true if get control minimum size found, false otherwise.
controlObject:
The control object to check for minimum size.
size:
The minimum size of the control if provided.