Rhino.Collections.RhinoList.PointCloudKNeighbors(Rhino.Geometry.PointCloud,System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Int32)
Finds a certain amout of points in a list of 3D points that are the k-closest to a test point.
This method searches needlePoints by computing all distances from each pointcloud point and keeping a short list.
pointcloud: A point cloud to be searched.
needlePoints: Points to search for.
amount: The required amount of closest neighbors to find.
Returns: An enumerable of arrays of indices; each array contains the indices for each of the needlePts.
Rhino.Geometry.RTree.PointCloudKNeighbors(Rhino.Geometry.PointCloud,System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Int32)

Rhino.Collections.RhinoList.Point3dKNeighbors(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Int32)
Finds a certain amout of points in a list of 3D points that are the k-closest to a test point.
This method searches needlePoints by computing all distances from each pointcloud point and keeping a "short list".
See RTree KNeighbors for alternatives.
hayPoints: A point cloud to be searched.
needlePoints: Points to search for.
amount: The required amount of closest neighbors to find.
Returns: An enumerable of arrays of indices; each array contains the indices for each of the needlePts.
Rhino.Geometry.RTree.Point3dKNeighbors(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Int32)

Rhino.Collections.RhinoList.Point3fKNeighbors(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3f},System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3f},System.Int32)
Finds a certain amout of points in a list of single-precision 3D points that are the k-closest to a test point.
This method searches needlePoints by computing all distances from each pointcloud point and keeping a "short list".
hayPoints: A point cloud to be searched.
needlePoints: Points to search for.
amount: The required amount of closest neighbors to find.
Returns: An enumerable of arrays of indices; each array contains the indices for each of the needlePts.
Rhino.Geometry.RTree.Point3dKNeighbors(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Int32)

Rhino.Collections.RhinoList.Point2dKNeighbors(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point2d},System.Collections.Generic.IEnumerable{Rhino.Geometry.Point2d},System.Int32)
Finds a certain amout of points in a list of single-precision 2D points that are the k-closest to a test point.
This method searches needlePoints by computing all distances from each pointcloud point and keeping a "short list".
hayPoints: A point cloud to be searched.
needlePoints: Points to search for.
amount: The required amount of closest neighbors to find.
Returns: An enumerable of arrays of indices; each array contains the indices for each of the needlePts.
Rhino.Geometry.RTree.Point3dKNeighbors(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Int32)

Rhino.Collections.RhinoList.Point2fKNeighbors(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point2f},System.Collections.Generic.IEnumerable{Rhino.Geometry.Point2f},System.Int32)
Finds a certain amout of points in a list of single-precision 2D points that are the k-closest to a test point.
This method searches needlePoints by computing all distances from each pointcloud point and keeping a "short list".
hayPoints: A point cloud to be searched.
needlePoints: Points to search for.
amount: The required amount of closest neighbors to find.
Returns: An enumerable of arrays of indices; each array contains the indices for each of the needlePts.
Rhino.Geometry.RTree.Point3dKNeighbors(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Int32)