Rhino.Geometry.AngularDimension.Create(Rhino.DocObjects.DimensionStyle,Rhino.Geometry.Plane,Rhino.Geometry.Vector3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)
Initialize Dimension parameters
dimStyle: Dimension's DimensionStyle
plane: Dimension's Plane
horizontal: Horizontal reference direction
centerpoint: Dimension centerpoint
defpoint1: First definition point
defpoint2: Second definition point
dimlinepoint: Point on dimension line
Returns:

Rhino.Geometry.AngularDimension.AdjustFromPoints(Rhino.Geometry.Plane,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)
Update Dimension geometry from point locations
plane: Dimension's plane
centerpoint: Dimension's centerpoint
defpoint1: First definition point
defpoint2: Second definition point
dimlinepoint: Point on dimension line
Returns:

Rhino.Geometry.AngularDimension.Create(System.Guid,Rhino.Geometry.Plane,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)
Initialize Dimension parameters
styleId: Dimension's AnnotationStyle
plane: Dimension's plane
extpoint1: First dimension point
extpoint2: Second definition point
dirpoint1: First direction point
dirpoint2: Second direction point
dimlinepoint: Point on dimension line
Returns:

Rhino.Geometry.AngularDimension.AdjustFromPoints(Rhino.Geometry.Plane,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)
Update Dimension geometry from point locations
plane: Dimension's plane
extpoint1: First dimension point
extpoint2: Second definition point
dirpoint1: First direction point
dirpoint2: Second direction point
dimlinepoint: Point on dimension line
Returns:

Rhino.Geometry.AngularDimension.Get3dPoints(Rhino.Geometry.Point3d@,Rhino.Geometry.Point3d@,Rhino.Geometry.Point3d@,Rhino.Geometry.Point3d@,Rhino.Geometry.Point3d@,Rhino.Geometry.Point3d@,Rhino.Geometry.Point3d@)
Get locations of dimension's 3d points
centerpoint: Dimension's center point
defpoint1: First definition point
defpoint2: Second definition point
arrowpoint1: First arrow point
arrowpoint2: Second arrow point
dimlinepoint: Point on dimension line
textpoint: Text location point
Returns: