Rhino.Geometry.DevelopableSrf.GetLocalDevopableRuling(Rhino.Geometry.NurbsCurve,System.Double,Rhino.Geometry.Interval,Rhino.Geometry.NurbsCurve,System.Double,Rhino.Geometry.Interval,System.Double@,System.Double@)
Finds minimum twist ruling between 2 curves at local domains
rail0:   First rail
t0:      Seed param on first rail
dom0:    Param subdomain to adjust in on first rail
rail1:   Second rail
t1:      Seed param on second rail
dom1:    Param subdomain to adjust in on second rail
t0_out:  Result ruling on first rail
t1_out:  Result ruling on second rail
Returns:
-1: Error
0: Exact non-twisting ruling found between t0_out and t1_out
1: Ruling found between t0_out and t1_out that has less twist
the ruling between t0 and t1

Rhino.Geometry.DevelopableSrf.RulingMinTwist(Rhino.Geometry.NurbsCurve,System.Double,Rhino.Geometry.NurbsCurve,System.Double,Rhino.Geometry.Interval,System.Double@,System.Double@)
Find a ruling from rail0(t0) to rail1(t1_out) that has the least twist
across the ruling with t1_out in domain1.
max_cos_twist is cos(twist) for the returned ruling
rail0:
t0:
rail1:
t1:
dom1:
t1_out:
cos_twist_out:
Returns:

Rhino.Geometry.DevelopableSrf.RulingMinTwist(Rhino.Geometry.NurbsCurve,System.Double,Rhino.Geometry.Interval,Rhino.Geometry.NurbsCurve,System.Double,Rhino.Geometry.Interval,System.Double@,System.Double@,System.Double@)
Find a ruling from rail0(t0_out) to rail1(t1_out) that has the least twist
across the ruling with t0_out in domain0 and t1_out in domain1.
max_cos_twist is cos(twist) for the returned ruling
rail0:
t0:
dom0:
rail1:
t1:
dom1:
t0_out:
t1_out:
cos_twist_out:
Returns: