Rhino.Render.RenderTexture.SaveAsImage(System.String,System.Int32,System.Int32,System.Int32)
Save texture as image
FullPath: The full path of the file
width: Image width
height: Image height
depth: Image depth
Returns: returns true if file was saved, otherwise false

Rhino.Render.RenderTexture.IsImageBased
Query if the texture is image based.
Returns: true if the texture is image-based.