Rhino.Input.Custom.GetBaseClass.AddOption(System.String)
Adds a command line option.
englishOption: Must only consist of letters and numbers (no characters list periods, spaces, or dashes).
Returns: option index value (>0) or 0 if option cannot be added.

Rhino.Input.Custom.GetBaseClass.AddOption(System.String,System.String)
Adds a command line option.
englishOption: Must only consist of letters and numbers (no characters list periods, spaces, or dashes).
englishOptionValue: The option value in English, visualized after an equality sign.
Returns: Option index value (>0) or 0 if option cannot be added.

Rhino.Input.Custom.GetBaseClass.AddOption(System.String,System.String,System.Boolean)
Adds a command line option.
englishOption: Must only consist of letters and numbers (no characters list periods, spaces, or dashes).
englishOptionValue: The option value in English, visualized after an equality sign.
hiddenOption: If true, the option is not displayed on the command line and the full option name must be typed in order to activate the option.
Returns: Option index value (>0) or 0 if option cannot be added.

Rhino.Input.Custom.GetBaseClass.AddOption(Rhino.UI.LocalizeStringPair)
Adds a command line option.
optionName: Must only consist of letters and numbers (no characters list periods, spaces, or dashes).
Returns: option index value (>0) or 0 if option cannot be added.

Rhino.Input.Custom.GetBaseClass.AddOption(Rhino.UI.LocalizeStringPair,Rhino.UI.LocalizeStringPair)
Adds a command line option.
optionName: Must only consist of letters and numbers (no characters list periods, spaces, or dashes).
optionValue: The localized value visualized after an equality sign.
Returns: option index value (>0) or 0 if option cannot be added.

Rhino.Input.Custom.GetBaseClass.AddOption(Rhino.UI.LocalizeStringPair,Rhino.UI.LocalizeStringPair,System.Boolean)
Adds a command line option.
optionName: Must only consist of letters and numbers (no characters list periods, spaces, or dashes).
optionValue: The localized value visualized after an equality sign.
hiddenOption: If true, the option is not displayed on the command line and the full option name must be typed in order to activate the option.
Returns: option index value (>0) or 0 if option cannot be added.