Rhino.Geometry.NurbsCurve.MakeCompatible(System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Int32,System.Int32,System.Double,System.Double)
For expert use only. From the input curves, make an array of compatible NURBS curves.
curves: The input curves.
startPt: The start point. To omit, specify Point3d.Unset.
endPt: The end point. To omit, specify Point3d.Unset.
simplifyMethod: The simplify method.
numPoints: The number of rebuild points.
refitTolerance: The refit tolerance.
angleTolerance: The angle tolerance in radians.
Returns: The output NURBS surfaces if successful.

Rhino.Geometry.NurbsCurve.CreateParabolaFromVertex(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)
Createsa a parabola from vertex and end points.
vertex: The vertex point.
startPoint: The start point.
endPoint: The end point
Returns: A 2 degree NURBS curve if successful, false otherwise.

Rhino.Geometry.NurbsCurve.CreateParabolaFromFocus(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)
Creates a parabola from focus and end points.
focus: The focal point.
startPoint: The start point.
endPoint: The end point
Returns: A 2 degree NURBS curve if successful, false otherwise.

Rhino.Geometry.NurbsCurve.SetGrevillePoints(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d})
Sets all Greville (Edit) points for this curve.
points:
The new point locations. The number of points should match
the number of point returned by NurbsCurve.GrevillePoints().
Returns: true if successful, false otherwise.