Rhino.PlugIns.LicenseStatus.PluginId
The ID of the plug-in that owns this license information

Rhino.PlugIns.LicenseStatus.CloudZooLeaseExpiration
Returns the expiration date of the lease this instance represents.