Rhino.Geometry.BezierCurve.GetObjectData(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)
Populates a System.Runtime.Serialization.SerializationInfo with the data needed to serialize the target object.
info: The System.Runtime.Serialization.SerializationInfo to populate with data.
context: The destination (see System.Runtime.Serialization.StreamingContext) for this serialization.

Rhino.Geometry.BezierCurve.Dimension
Dimension of Bezier