Rhino.DocObjects.Worksession.RuntimeSerialNumber
Unique serial number for the worksession while the application is running.
This is not a persistent value.

Rhino.DocObjects.Worksession.FileNameFromRuntimeSerialNumber(System.UInt32)
Returns the path to the open worksession, or .rws, file.
If there is no worksession file open, or the active worksession
has not yet been saved, then null is returned.
runtimeSerialNumber:
Returns:

Rhino.DocObjects.Worksession.ModelPathFromSerialNumber(System.UInt32)
Returns the path to a model, used by the worksession, given a reference model serial number
modelSerialNumber: The reference model serial number.
Returns: The path to the model if successful, null otherwise.