Rhino.DocObjects.Group.SetUserString(System.String,System.String)
Attach a user string (key,value combination) to this geometry.
key: id used to retrieve this string.
value: string associated with key.
Returns: true on success.

Rhino.DocObjects.Group.GetUserString(System.String)
Gets user string from this geometry.
key: id used to retrieve the string.
Returns: string associated with the key if successful. null if no key was found.

Rhino.DocObjects.Group.UserStringCount
Gets the amount of user strings.

Rhino.DocObjects.Group.GetUserStrings
Gets a copy of all (user key string, user value string) pairs attached to this geometry.
Returns: A new collection.