Rhino.Geometry.Intersect.Intersection.CurveBrep(Rhino.Geometry.Curve,Rhino.Geometry.Brep,System.Double,Rhino.Geometry.Curve[]@,Rhino.Geometry.Point3d[]@,System.Double[]@)
Intersects a curve with a Brep. This function returns the 3D points of intersection, curve parameters at the intersection locations,
and 3D overlap curves. If an error occurs while processing overlap curves, this function
will return false, but it will still provide partial results.
curve: Curve for intersection.
brep: Brep for intersection.
tolerance: Fitting and near miss tolerance.
overlapCurves: The overlap curves will be returned here.
intersectionPoints: The intersection points will be returned here.
curveParameters: The intersection curve parameters will be returned here.
Returns: true on success, false on failure.