Rhino.Render.RenderPrimitiveList.Add(Rhino.Geometry.Mesh,Rhino.Render.RenderMaterial,Rhino.Geometry.Transform)
Add mesh and material.
mesh: Mesh to add.
material:
t: Transformation of this mesh.
Material to add, may be null if not needed.

Rhino.Render.RenderPrimitiveList.MeshInstance(System.Int32,Rhino.Geometry.Transform@)
Get the mesh for the primitive at the specified index. If the item at
this index is a primitive type other than a mesh then it mesh
representation is returned.
index:
The zero based index of the item in the list.  Valid values are greater
than or equal to 0 and less than Count.
instance_transform:
Receives the transformation of this mesh.
Returns:
Returns the mesh for the primitive at the specified index. If the item
at this index is a primitive type other than a mesh then it mesh
representation is returned.