Rhino.Geometry.Vector3f.IsValid
Returns an indication regarding the validity of this vector.

Rhino.Geometry.Vector3f.SquareLength
Returns the square length of the vector.
This property does not check for the validity of the inputs.