Rhino.Geometry.HiddenLineDrawingParameters.AddGeometry(Rhino.Geometry.GeometryBase,Rhino.Geometry.Transform,System.Object)
Add geometry that should be included in the calculation
geometry:
Currently only points, point clouds, curves, meshes, breps, surfaces, and extrusions are supported
xform:
tag: arbitrary data to be associated with this geometry
Returns:
true if the type of geometry can be added for calculations.
Currently only points, point clouds, curves, meshes, breps, surfaces and extrusions are supported