Rhino.Geometry.Vector3d.CrossProduct(Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d)
Computes the cross product (or vector product, or exterior product) of two vectors.
This operation is not commutative.
a: First vector.
b: Second vector.
Returns: A new vector that is perpendicular to both a and b,
has Length == a.Length * b.Length * sin(theta) where theta is the angle between a and b.
The resulting vector is oriented according to the right hand rule.

Rhino.Geometry.Vector3d.AreOrthogonal(Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d)
Test whether three vectors describe an orthogonal axis system.
All vectors must be mutually perpendicular this to be the case.
x: X axis vector.
y: Y axis vector.
z: Z axis vector.
Returns: True if all vectors are non-zero and mutually perpendicular.

Rhino.Geometry.Vector3d.AreOrthonormal(Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d)
Test whether three vectors describe an orthogonal, unit axis system.
All vectors must be mutually perpendicular and have unit length for this to be the case.
x: X axis vector.
y: Y axis vector.
z: Z axis vector.
Returns: True if all vectors are non-zero and mutually perpendicular.

Rhino.Geometry.Vector3d.AreRighthanded(Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d)
Test whether three vectors describe a right-handed, orthogonal, unit axis system.
The vectors must be orthonormal and follow the right-hand ordering; index-finger=x,
middle-finger=y, thumb=z.
x: X axis vector.
y: Y axis vector.
z: Z axis vector.
Returns: True if all vectors are non-zero and mutually perpendicular.