Rhino.DocObjects.Layer.HasPerViewportSettings(System.Guid)
Verifies that a layer has per viewport settings.
viewportId:
If not Guid.Empty, then checks for settings for that specific viewport.
If Guid.Empty, then checks for any viewport settings.
Returns: True if the layer has per viewport settings, false otherwise.

Rhino.DocObjects.Layer.DeletePerViewportSettings(System.Guid)
Deletes per viewport layer settings.
viewportId:
If not Guid.Empty, then the settings for that viewport are deleted.
If Guid.Empty, then all per viewport settings are deleted.

Rhino.DocObjects.Layer.PerViewportColor(System.Guid)
Gets the display color for this layer.
viewportId: If not Guid.Empty, then the setting applies only to the viewport with the specified id.
Returns: The display color.

Rhino.DocObjects.Layer.SetPerViewportColor(System.Guid,System.Drawing.Color)
Sets the display color for this layer.
viewportId: If not Guid.Empty, then the setting applies only to the viewport with the specified id.
color: The display color.

Rhino.DocObjects.Layer.DeletePerViewportColor(System.Guid)
Remove any per viewport layer color setting so the layer's overall setting will be used for all viewports.
viewportId:
If not Guid.Empty, then the setting for this viewport will be deleted.
If Guid.Empty, the all per viewport layer color settings will be removed.

Rhino.DocObjects.Layer.PerViewportPlotColor(System.Guid)
Gets the plot color for this layer.
viewportId: If not Guid.Empty, then the setting applies only to the viewport with the specified id.
Returns: The plot color.

Rhino.DocObjects.Layer.SetPerViewportPlotColor(System.Guid,System.Drawing.Color)
Sets the plot color for this layer.
viewportId: If not Guid.Empty, then the setting applies only to the viewport with the specified id.
color: The plot color.

Rhino.DocObjects.Layer.DeletePerViewportPlotColor(System.Guid)
Remove any per viewport layer plot color setting so the layer's overall setting will be used for all viewports.
viewportId:
If not Guid.Empty, then the setting for this viewport will be deleted.
If Guid.Empty, the all per viewport layer color settings will be removed.

Rhino.DocObjects.Layer.PlotWeight
Gets or sets the weight of the plotting pen in millimeters.
A weight of 0.0 indicates the "default" pen weight should be used.
A weight of -1.0 indicates the layer should not be printed.

Rhino.DocObjects.Layer.PerViewportPlotWeight(System.Guid)
Gets the plot weight, in millimeters, for this layer.
viewportId: If not Guid.Empty, then the setting applies only to the viewport with the specified id.
Returns: The plot color.

Rhino.DocObjects.Layer.SetPerViewportPlotWeight(System.Guid,System.Double)
Sets the plot weight, in millimeters, for this layer.
viewportId: If not Guid.Empty, then the setting applies only to the viewport with the specified id.
plotWeight:
The plot weight in millimeters.
A weight of  0.0 indicates the "default" pen weight should be used.
A weight of -1.0 indicates the layer should not be printed.

Rhino.DocObjects.Layer.DeletePerViewportPlotWeight(System.Guid)
Remove any per viewport layer plot weight setting so the layer's overall setting will be used for all viewports.
viewportId:
If not Guid.Empty, then the setting for this viewport will be deleted.
If Guid.Empty, the all per viewport layer color settings will be removed.

Rhino.DocObjects.Layer.PerViewportIsVisible(System.Guid)
Gets the per viewport visibility of this layer.
viewportId:
If not Guid.Empty, then the visibility setting for that viewport is returned.
If Guid.Empty, the IsVisible property is returned.
Returns: Returns true if objects on layer are visible.

Rhino.DocObjects.Layer.SetPerViewportVisible(System.Guid,System.Boolean)
Controls layer visibility in specific viewports.
viewportId:
If not Guid.Empty, then the setting applies only to the viewport with the specified id.
If Guid.Empty, then the setting applies to all viewports with per viewport layer settings.
visible: true to make layer visible, false to make layer invisible.

Rhino.DocObjects.Layer.DeletePerViewportVisible(System.Guid)
Remove any per viewport visibility setting so the layer's overall setting will be used for all viewports.
viewportId:
If not Guid.Empty, then the setting for this viewport will be deleted.
If Guid.Empty, the all per viewport visibility settings will be removed.

Rhino.DocObjects.Layer.PerViewportPersistentVisibility(System.Guid)
Gets the per layer persistent visibility. The persistent visbility setting is used for layers whose visibilty can be changed by a parent layer.
In this case, when a parent layer is turned off, then child layers are also turned off.
The persistent visibility setting determines what happens when the parent is turned on again.
viewportId:
Returns:
Return true if this layer's visibility in the specified viewport is controlled by a parent object and the parent is turned on (after being off),
then this layer will also be turned on in the specified viewport.
Returns false if this layer's visibility in the specified viewport is controlled by a parent object and the parent layer is turned on(after being off),
then this layer will continue to be off in the specified viewport.

Rhino.DocObjects.Layer.SetPerViewportPersistentVisibility(System.Guid,System.Boolean)
Sets the per layer persistent visibility. The persistent visbility setting is used for layers whose visibilty can be changed by a parent layer.
In this case, when a parent layer is turned off, then child layers are also turned off.
The persistent visibility setting determines what happens when the parent is turned on again.
viewportId:
If not Guid.Empty, then the setting applies only to the viewport with the specified id.
If Guid.Empty, then the setting applies to all viewports with per viewport layer settings.
persistentVisibility:
If true, this layer's visibility in the specified viewport is controlled by a parent object and the parent is turned on (after being off),
then this layer will also be turned on in the specified viewport.
If false, this layer's visibility in the specified viewport is controlled by a parent object and the parent layer is turned on (after being off),
then this layer will continue to be off in the specified viewport.

Rhino.DocObjects.Layer.UnsetPerViewportPersistentVisibility(System.Guid)
Remove any per viewport persistent visibility setting so the layer's overall setting will be used for all viewports.
viewportId:
If not Guid.Empty, then the setting for this viewport will be deleted.
If Guid.Empty, the all per viewport visibility settings will be removed.