Rhino.Geometry.PolyCurve.AppendSegment(Rhino.Geometry.Curve)
Appends the curve to the polycurve without changing the new segment's geometry.
This function will fail if the PolyCurve is closed or if SegmentCount > 0 and the new segment is closed.
curve: Segment to append.
Returns: true on success, false on failure.