Rhino.DocObjects.Tables.RuntimeDocumentDataTable.Document
Document this user data table is associated with

Rhino.DocObjects.Tables.RuntimeDocumentDataTable.GetValue``1(System.Object,System.Func{Rhino.RhinoDoc,``0})
Checks the dictionary for the specified key, if found and the value is not
null then then the value is returned.  If the key is not found or its value
is null then newT(Document) is called to create a new value instnce which
is put in the dictionary and returned.
Class type created as necessary and returned.
key:
Key to search for.
newT:
Function called to create new value
Returns:
Returns the document specific instance of type T using the specified
dictionary key.
var data = doc?.RuntimeData.GetValue(typeof(MyClass), rhinoDoc => new MyClass(rhinoDoc));

Rhino.DocObjects.Tables.RuntimeDocumentDataTable.TryGetValue``1(System.Object)
Check dictionary for value and return it properly cast if
found.
key:
Key to search for.
Class type created as necessary and returned.
Returns:
Returns the document specific instance of type T using the specified
dictionary key or null if not found.