Rhino.Render.SafeFrame.#ctor
Create an utility object not associated with any document

Rhino.Render.SafeFrame.#ctor(Rhino.Render.SafeFrame)
Create an utility object not associated with any document from another object
g:

Rhino.Render.SafeFrame.Enabled
Determines whether the safeframe is enabled.