Rhino.Runtime.ISettingsService.SupportsPlist
If true then WriteToPlist and ReadFromPlist are alled to serialize settings
otherwise; WriteSettings and ReadSettings are called using XML in a memroy
stream.
true if supports plist; otherwise, false.

Rhino.Runtime.ISettingsService.SupportsAllUsers
Return true if the settings system supports reading from the AllUsers location
prior to the current user section.  If this is true any settings read from
AllUsers will be marked as read-only at runtime

Rhino.Runtime.ISettingsService.UseFileWatchers
Return true if the settings system should use file watchers when reading settings
to determine when settings have changed so changed events can be raised.

Rhino.Runtime.ISettingsService.RaiseChangedEventAfterWriting
Return true if settings changed events should be raised immediately after writing
the settings file.

Rhino.Runtime.ISettingsService.WriteToPlist(System.Boolean,Rhino.PersistentSettings,System.Collections.Generic.Dictionary{System.String,Rhino.PersistentSettings},System.Action{System.Boolean,System.Boolean})
Writes the settings.
Returns: true, if settings was writed, false otherwise.
isShuttingDown: If set to true is shutting down.
settings: Settings.
commandSettings: Command settings.
writing: Writing.

Rhino.Runtime.ISettingsService.TryGetPlistValue(Rhino.PersistentSettings,System.String,System.Func{System.String,Rhino.SettingValue})
Check to see if a setting value exist in a key and if it does create a new
SettingValue and iniialize its ValueString using the plist value.
persistentSettings: Persistent settings containing the key.
key: Setting value key name.
newSettingValue:
Invoked to create new SettingValue which will get initialized with the current
PLIST value.

Rhino.Runtime.ISettingsService.ReadSettings(System.String)
Read settings XML contents into a Stream which will get passed to a XML
document for parsing.
fileName: File name.
Returns:
Returns null if the file does not exist or could not be read, a valid
Stream otherwise.

Rhino.Runtime.ISettingsService.ReadFromPlist(System.Guid,Rhino.PersistentSettings@,System.Func{System.String,Rhino.PersistentSettings})
Read settings directly from some system provided archive.  This is used
on Mac to read settings from the com.mcneel.rhinoceros.plist
Returns: true, if read settings was directed, false otherwise.
plugInId: Plug in identifier.
settings: Settings.
commandSettings: Command settings.

Rhino.Runtime.ISettingsService.DeleteSettingsFile(System.String)
Deletes the settings file.
fileName:
Full path to settings to delete.

Rhino.Runtime.ISettingsService.OnAddSettingValue(Rhino.SettingValue)
Called when a new setting value is added to the runtime
dictionary, Mac Rhino should check the PLIST for the
key and initialze it with the current key value
settingValue: Setting value.