Rhino.Render.RenderPipeline.RenderSize(Rhino.RhinoDoc,System.Boolean)
Get the render size as specified in the ON_3dmRenderSettings, and from RenderSources when
fromRenderSources is true.
Returns: The render size.

Rhino.Render.RenderPipeline.GetRenderWindow(System.Boolean,System.Boolean)
As GetRenderWindow().
The parameter withWireframeChannel controls whether
the returned RenderWindow will have the channel added.
The parameter fromRenderViewSource controls from where
the RenderSize is queried.
withWireframeChannel: true if the RenderWindow needs to have a wireframe channel.
fromRenderViewSource: true if the RenderWindow size needs to be set from RenderViewSource size. false will
use the active view.
Returns: RenderWindow if one exists, null otherwise (i.e. rendering
has already completed).

Rhino.Render.RenderPipeline.GetRenderWindow
Get the RenderWindow associated with this RenderPipeline instance.  This is virtual rather than abstract for V5 compat
Returns: RenderWindow if one exists, null otherwise (i.e. rendering
has already completed).

Rhino.Render.RenderPipeline.GetRenderWindowFromRenderViewSource(System.Boolean)
Like GetRenderWindow(), but with the size for RenderWindow
set from RenderViewSources if fromRenderViewSource is set to true
fromRenderViewSource: true if
Returns: RenderWindow if one exists, null otherwise (i.e. rendering
has already completed).