Rhino.Geometry.Curve.CreateArcBlend(Rhino.Geometry.Point3d,Rhino.Geometry.Vector3d,Rhino.Geometry.Point3d,Rhino.Geometry.Vector3d,System.Double)
Creates a polycurve consisting of two tangent arc segments that connect two points and two directions.
startPt: Start of the arc blend curve.
startDir: Start direction of the arc blend curve.
endPt: End of the arc blend curve.
endDir: End direction of the arc blend curve.
controlPointLengthRatio:
The ratio of the control polygon lengths of the two arcs. Note, a value of 1.0
means the control polygon lengths for both arcs will be the same.
Returns: The arc blend curve, or null on error.

Rhino.Geometry.Curve.Smooth(System.Double,System.Boolean,System.Boolean,System.Boolean,System.Boolean,Rhino.Geometry.SmoothingCoordinateSystem)
Smooths a curve by averaging the positions of control points in a specified region.
smoothFactor: The smoothing factor, which controls how much control points move towards the average of the neighboring control points.
bXSmooth: When true control points move in X axis direction.
bYSmooth: When true control points move in Y axis direction.
bZSmooth: When true control points move in Z axis direction.
bFixBoundaries: When true the curve ends don't move.
coordinateSystem: The coordinates to determine the direction of the smoothing.
Returns: The smoothed curve if successful, null otherwise.

Rhino.Geometry.Curve.Smooth(System.Double,System.Boolean,System.Boolean,System.Boolean,System.Boolean,Rhino.Geometry.SmoothingCoordinateSystem,Rhino.Geometry.Plane)
Smooths a curve by averaging the positions of control points in a specified region.
smoothFactor: The smoothing factor, which controls how much control points move towards the average of the neighboring control points.
bXSmooth: When true control points move in X axis direction.
bYSmooth: When true control points move in Y axis direction.
bZSmooth: When true control points move in Z axis direction.
bFixBoundaries: When true the curve ends don't move.
coordinateSystem: The coordinates to determine the direction of the smoothing.
plane: If SmoothingCoordinateSystem.CPlane specified, then the construction plane.
Returns: The smoothed curve if successful, null otherwise.

Rhino.Geometry.Curve.GetLocalPerpPoint(Rhino.Geometry.Point3d,System.Double,System.Double@)
Search for a location on the curve, near seedParmameter, that is perpendicular to a test point.
testPoint: The test point.
seedParmameter: A "seed" parameter on the curve.
curveParameter: The parameter value at the perpendicular point
Returns: True if a solution is found, false otherwise.

Rhino.Geometry.Curve.GetLocalPerpPoint(Rhino.Geometry.Point3d,System.Double,Rhino.Geometry.Interval,System.Double@)
Search for a location on the curve, near seedParmameter, that is perpendicular to a test point.
testPoint: The test point.
seedParmameter: A "seed" parameter on the curve.
subDomain: The sub-domain of the curve to search.
curveParameter: The parameter value at the perpendicular point
Returns: True if a solution is found, false otherwise.

Rhino.Geometry.Curve.GetLocalTangentPoint(Rhino.Geometry.Point3d,System.Double,System.Double@)
Search for a location on the curve, near seedParmameter, that is tangent to a test point.
testPoint: The test point.
seedParmameter: A "seed" parameter on the curve.
curveParameter: The parameter value at the tangent point
Returns: True if a solution is found, false otherwise.

Rhino.Geometry.Curve.GetLocalTangentPoint(Rhino.Geometry.Point3d,System.Double,Rhino.Geometry.Interval,System.Double@)
Search for a location on the curve, near seedParmameter, that is tangent to a test point.
testPoint: The test point.
seedParmameter: A "seed" parameter on the curve.
subDomain: The sub-domain of the curve to search.
curveParameter: The parameter value at the tangent point
Returns: True if a solution is found, false otherwise.

Rhino.Geometry.Curve.LcoalClosestPoint(Rhino.Geometry.Point3d,System.Double,System.Double@)
Find parameter of the point on a curve that is locally closest to
the testPoint.  The search for a local close point starts at
a seed parameter.
testPoint: A point to test against.
seed: The seed parameter.
t: >Parameter of the curve that is closest to testPoint.
Returns: true if the search is successful, false if the search fails.