Rhino.ApplicationSettings.ViewSettings.ZoomExtentsParallelViewBorder
Border amount to apply to parallel viewport during zoom extents

Rhino.ApplicationSettings.ViewSettings.ZoomExtentsPerspectiveViewBorder
Border amount to apply to perspective viewport during zoom extents