Rhino.Geometry.Collections.MeshVertexList.UseDoublePrecisionVertices
Set to true if the vertices should be stored in double precision

Rhino.Geometry.Collections.MeshVertexList.SetVertex(System.Int32,System.Double,System.Double,System.Double,System.Boolean)
Sets or adds a vertex to the Vertex List.
If [index] is less than [Count], the existing vertex at [index] will be modified.
If [index] equals [Count], a new vertex is appended to the end of the vertex list.
If [index] is larger than [Count], the function will return false.
index: Index of vertex to set.
x: X component of vertex location.
y: Y component of vertex location.
z: Z component of vertex location.
updateNormals: Set to true if you'd like the vertex and face normals impacted by the change updated.
Returns: true on success, false on failure.

Rhino.Geometry.Collections.MeshVertexList.Point3dAt(System.Int32)
Get double precision location at a given index
index:
Returns: