Rhino.Geometry.RadialDimension.Create(Rhino.DocObjects.DimensionStyle,Rhino.Geometry.AnnotationType,Rhino.Geometry.Plane,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)
Initialize Dimension parameters
dimStyle: Dimension's dimstyle
dimtype: AnnotationType.Diameter or AnnotationType.Radius
plane: Dimension's plane
centerpoint: Dimension's center point
radiuspoint: Point on dimension radius
dimlinepoint: Point on dimension line
Returns:

Rhino.Geometry.RadialDimension.AdjustFromPoints(Rhino.Geometry.Plane,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Double)
Update Dimension geometry from point locations
plane: Dimension's plane
centerpoint: Dimension's center point
radiuspoint: Point on dimension radius
dimlinepoint: Point on dimension line
rotationInPlane: Rotation around plane origin
Returns:

Rhino.Geometry.RadialDimension.Get3dPoints(Rhino.Geometry.Point3d@,Rhino.Geometry.Point3d@,Rhino.Geometry.Point3d@,Rhino.Geometry.Point3d@)
Get locations of dimension's 3d points
centerpoint: Dimension's center point
radiuspoint: Point on dimension's radius
kneepoint: Point where dimension line jogs
dimlinepoint: Point on dimension line
Returns:

Rhino.Geometry.RadialDimension.LeaderTextHorizontalAlignment
Gets or sets the horizontal alignment of the radial dimension's text