Rhino.Geometry.NurbsSurface.CreateCurveOnSurfacePoints(Rhino.Geometry.Surface,System.Collections.Generic.IEnumerable{Rhino.Geometry.Point2d},System.Double,System.Boolean,System.Int32,System.Int32)
Computes a discrete spline curve on the surface. In other words, computes a sequence
of points on the surface, each with a corresponding parameter value.
surface:
The surface on which the curve is constructed. The surface should be G1 continuous.
If the surface is closed in the u or v direction and is G1 at the seam, the
function will construct point sequences that cross over the seam.
fixedPoints: Surface points to interpolate given by parameters. These must be distinct.
tolerance: Relative tolerance used by the solver. When in doubt, use a tolerance of 0.0.
periodic: When true constructs a smoothly closed curve.
initCount: Maximum number of points to insert beteween fixed points on the first level.
levels: The number of levels (between 1 and 3) to be used in multi-level solver. Use 1 for single level solve.
Returns:
A sequence of surface points, given by surface parameters, if successful.
The number of output points is approximatelely: 2 ^ (level-1) * initCount * fixedPoints.Count.
Remarks:
To create a curve from the output points, use Surface.CreateCurveOnSurface.

Rhino.Geometry.NurbsSurface.CreateCurveOnSurface(Rhino.Geometry.Surface,System.Collections.Generic.IEnumerable{Rhino.Geometry.Point2d},System.Double,System.Boolean)
Fit a sequence of 2d points on a surface to make a curve on the surface.
surface: Surface on which to construct curve.
points: Parameter space coodinates of the points to interpolate.
tolerance: Curve should be within tolerance of surface and points.
periodic: When true make a periodic curve.
Returns: A curve interpolating the points if successful, null on error.
Remarks:
To produce the input points, use Surface.CreateCurveOnSurfacePoints.

Rhino.Geometry.NurbsSurface.MakeCompatible(Rhino.Geometry.Surface,Rhino.Geometry.Surface,Rhino.Geometry.NurbsSurface@,Rhino.Geometry.NurbsSurface@)
For expert use only. Makes a pair of compatible NURBS surfaces based on two input surfaces.
surface0: The first surface.
surface1: The second surface.
nurb0: The first output NURBS surface.
nurb1: The second output NURBS surface.
Returns: true if successsful, false on failure.