Rhino.Geometry.BrepFace.Brep
Gets the Brep that owns this face.

Rhino.Geometry.BrepFace.RemoveHoles(System.Double)
Remove all inner loops, or holes, from a Brep face.
tolerance:
Returns:

Rhino.Geometry.BrepFace.ShrinkFace(Rhino.Geometry.BrepFace.ShrinkDisableSide)
Shrinks the underlying surface of this face.
Sometimes the surface used by a face extends far beyond the face's outer boundary.
This function remove portions of the surface that extend beyond the face's outer boundary loop.
disableSide: The side(s) of the surface to not shrink.
Returns: true on success, false on failure.