Rhino.Runtime.Interop.NSFontFromFont(Rhino.DocObjects.Font)
Get native NSFont* from a Rhino Font. Only works on Mac
Returns: NSFont* on success. IntPtr.Zero on failure
font:

Rhino.Runtime.Interop.NSFontFromFont(Rhino.DocObjects.Font,System.Double)
Get native NSFont* from a Rhino Font. Only works on Mac
Returns: NSFont* on success. IntPtr.Zero on failure
font:
pointSize: Point size