Rhino.Geometry.Circle.#ctor(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)
Initializes a circle through three 3d points.
point1: The start/end of the circle is at point1.
point2: Second point on the circle.
point3: Third point on the circle.

Rhino.Geometry.Circle.TryFitCircleToPoints(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},Rhino.Geometry.Circle@)
Attempt to fit a circle through a set of points.
points: The points through which to fit.
circle: The resulting circle on success.
Returns: true on success, false on failure.