Rhino.ApplicationSettings.CurvatureAnalysisSettingsState.GaussRange
Gets or sets the Gaussian curvature range.

Rhino.ApplicationSettings.CurvatureAnalysisSettingsState.MeanRange
Gets or sets the Mean curvature range.

Rhino.ApplicationSettings.CurvatureAnalysisSettingsState.MinRadiusRange
Gets or sets the Minimum Radius curvature range.

Rhino.ApplicationSettings.CurvatureAnalysisSettingsState.MaxRadiusRange
Gets or sets the Maximum Radius curvature range.

Rhino.ApplicationSettings.CurvatureAnalysisSettingsState.Style
Gets or sets the curvature analysis style.