Rhino.Geometry.Hatch.BasePoint
Gets or sets the hatchpattern basepoint

Rhino.Geometry.Hatch.Plane
Gets or sets the hatch plane

Rhino.Geometry.Hatch.ScalePattern(Rhino.Geometry.Transform)
Scale the hatch's pattern
xform: