Rhino.Input.Custom.GetObject.ActiveGetObject(Rhino.RhinoDoc)
Get the currently running GetObject for a given document
doc:
Returns:

Rhino.Input.Custom.GetObject.AppendToPickList(Rhino.DocObjects.ObjRef)
objref:

Rhino.Input.Custom.GetObject.ClearObjects
Clear possible special object drawing