Rhino.Display.DisplayModeDescription.AddDisplayMode(System.String)
Adds a new display mode.
name: The name of the new display mode.
Returns: The id of the new display mode if successful. Guid.Empty on error.

Rhino.Display.DisplayModeDescription.CopyDisplayMode(System.Guid,System.String)
Copies an existing display mode.
id: The id of the existing display mode to copy.
name: The name of the new display mode.
Returns: The id of the new display mode if successful. Guid.Empty on error.

Rhino.Display.DisplayModeDescription.DeleteDiplayMode(System.Guid)
Deletes an existing display mode.
id: The id of the existing display mode to delete.
Returns: true if successful, false oteherwise.