Rhino.DocObjects.RhinoObject.MeshObjects(System.Collections.Generic.IEnumerable{Rhino.DocObjects.RhinoObject},Rhino.Geometry.MeshingParameters,Rhino.Geometry.Mesh[]@,Rhino.DocObjects.ObjectAttributes[]@)
Meshes Rhino objects.
rhinoObjects: The Rhino objects to mesh.
parameters: The parameters used to create the meshes.
meshes: The created meshes are appended to this array.
attributes: The object attributes that coincide with each created mesh are appended to this array.
Returns: The results of the calculation.

Rhino.DocObjects.RhinoObject.MeshObjects(System.Collections.Generic.IEnumerable{Rhino.DocObjects.RhinoObject},Rhino.Geometry.MeshingParameters@,System.Boolean@,Rhino.Geometry.Mesh[]@,Rhino.DocObjects.ObjectAttributes[]@)
Meshes Rhino objects.
rhinoObjects: The Rhino objects to mesh.
parameters: The parameters used to create the meshes. The meshing parameters may change.
simpleDialog: true to display the simple mesh parameters dialog, false to display the detailed mesh parameters dialog.
meshes: The created meshes are appended to this array.
attributes: The object attributes that coincide with each created mesh are appended to this array.
Returns: The results of the calculation.

Rhino.DocObjects.RhinoObject.MeshObjects(System.Collections.Generic.IEnumerable{Rhino.DocObjects.RhinoObject},Rhino.Geometry.MeshingParameters@,System.Int32@,Rhino.Geometry.Transform,Rhino.Geometry.Mesh[]@,Rhino.DocObjects.ObjectAttributes[]@)
Meshes Rhino objects.
rhinoObjects: The Rhino objects to mesh.
parameters: The parameters used to create the meshes. The meshing parameters may change.
uiStyle: The user interface style, where: -1 = no interface, 0 = simple dialog, 1 = details dialog, 2 = script or batch mode
xform: Transform to be used for export with origin, or Z to Y up, etc.
meshes: The created meshes are appended to this array.
attributes: The object attributes that coincide with each created mesh are appended to this array.
Returns: The results of the calculation.

Rhino.DocObjects.RhinoObject.GetFillSurfaces(Rhino.DocObjects.RhinoObject,Rhino.DocObjects.ClippingPlaneObject)
Return list of fill surfaces if any for object and clipping plane.
rhinoObject: Object to clip
clippingPlaneObject: Clipping plane to use
Returns:

Rhino.DocObjects.RhinoObject.GetFillSurfaces(Rhino.DocObjects.RhinoObject,System.Collections.Generic.IEnumerable{Rhino.DocObjects.ClippingPlaneObject})
Return list of fill surfaces if any for object and clipping plane. Fills are trimmed by
clipping planes that did not generate them.
rhinoObject: Object to clip
clippingPlaneObjects: Enumeration of clipping plane objects
Returns: Array of Brep containing fully trimmed fills if there were any generated.

Rhino.DocObjects.RhinoObject.GetFillSurfaces(Rhino.DocObjects.RhinoObject,System.Collections.Generic.IEnumerable{Rhino.DocObjects.ClippingPlaneObject},System.Boolean)
Return list of fill surfaces if any for object and clipping plane.
rhinoObject: Object to clip
clippingPlaneObjects: Enumeration of clipping plane objects
unclippedFills: Use true to get fills that are not trimmed by all clipping planes
Returns: Array of Brep containing fills if there were any generated, trimmed if unclippedFills was false

Rhino.DocObjects.RhinoObject.WorksessionReferenceSerialNumber
Obsolete - use ReferenceModelSerialNumber

Rhino.DocObjects.RhinoObject.ReferenceModelSerialNumber
When a component is in a model for reference, this value identifies the reference model.
Remarks:
Reference components are not saved in .3dm archives.
Typically this value is set and locked by the code that adds a component to a model.
This value is not saved in .3dm archives.

Rhino.DocObjects.RhinoObject.InstanceDefinitionModelSerialNumber
When a component is in a model as part of the information required for a linked instance definition,
this value identifies the the linked instance definition reference model.
Remarks:
Reference components are not saved in .3dm archives.
Typically this value is set and locked by the code that adds a component to a model.
This value is not saved in .3dm archives.

Rhino.DocObjects.RhinoObject.GetMeshes(Rhino.Geometry.MeshType)
Get existing meshes used to render and analyze surface and polysrf objects.
meshType:
Returns: An array of meshes.