Rhino.Display.ViewCaptureSettings.GetMargins(Rhino.UnitSystem,System.Double@,System.Double@,System.Double@,System.Double@)
Get distances from the edge of the paper (MediaSize) to the CropRectangle
in a defined unit system
lengthUnits: Units to get distances in
left: Distance from left edge of paper to left edge of CropRectangle
top: Distance from top edge of paper to top edge of CropRectangle
right: Distance from right edge of paper to right edge of CropRectangle
bottom: Distance from bottom edge of paper to bottom edge of CropRectangle
Returns:
True if successful.
False if unsuccessful (this could happen if there is no set device_dpi)

Rhino.Display.ViewCaptureSettings.SetMargins(Rhino.UnitSystem,System.Double,System.Double,System.Double,System.Double)
Set distances from the edge of the paper (MediaSize) to the CropRectange
in a defined unit system
lengthUnits: Units that left, top, right, and bottom are defined in
left: Distance from left edge of paper to left edge of CropRectangle
top: Distance from top edge of paper to top edge of CropRectangle
right: Distance from right edge of paper to right edge of CropRectangle
bottom: Distance from bottom edge of paper to bottom edge of CropRectangle
Returns:
True if successful.
False if unsuccessful (this could happen if there is no set device_dpi)

Rhino.Display.ViewCaptureSettings.WireThicknessScale
scaling factor to apply to object print widths (typically 1.0). This is
helpful when printing something at 1/2 scale and having all of the curves
print 1/2 as thick

Rhino.Display.ViewCaptureSettings.PointSizeMillimeters
size of point objects in millimeters
if scale <= 0 the size is minimized so points are always drawn as small as possible

Rhino.Display.ViewCaptureSettings.ArrowheadSizeMillimeters
arrowhead size in millimeters

Rhino.Display.ViewCaptureSettings.DefaultPrintWidthMillimeters
Line thickness used to print objects with no defined thickness (in mm)